[{
  "_id": {
    "$oid": "65b243b5611329c79ed7b004"
  },
  "episode": 1,
  "episodeTitle": "Episode number 1",
  "episodeReleaseDate": "February 10, 1940",
  "year": 1940,
  "network": "CBS",
  "length": "00:00",
  "videoURL": "http://127.0.0.1:8080/001.mp4",
  "thumbnail": "example.com/image.jpg",
  "description": "Tom chases Jerry all over their house, while Jerry foils Tom's plans to catch him. Tom breaks a lot of things in the house, while chasing Jerry, but that's when Mammy steps in. Mammy is Tom's owner. She tells him that if he breaks one more thing in the house, she's going to throw him outside. So, Jerry knocks over a lot of things in the house to make Mammy think Tom did it, and kick him outside. Tom tries his hardest to keep all these things from falling, so he won't be thrown outside.",
  "director": [
    "William Hanna",
    "Joseph Barbera"
  ]
},
{
  "_id": {
    "$oid": "65b243b5611329c79ed7b005"
  },
  "episode": 2,
  "episodeTitle": "The Midnight Snack",
  "episodeReleaseDate": "July 19, 1941",
  "year": 1941,
  "network": "CBS",
  "length": "00:00",
  "videoUrl": "",
  "thumbnail": "",
  "description": "Jerry decides to have a midnight snack. And what better than to have some nice, fresh cheese! He takes some from the fridge, but before he can eat it, Tom chases him for it. After breaking a lot of things, when chasing Jerry, Mammy hears the noise and comes down in a huff. Scared, Tom throws Jerry into the fridge to hide him. A bit later, Mammy finds Jerry in the fridge. She gets really angry, and throws Tom of out of the house. While Mammy is doing that, Jerry grabs the cheese, and finally eats it.",
  "director": [
    "William Hanna",
    "Joseph Barbera"
  ]
},
{
  "_id": {
    "$oid": "65b243b5611329c79ed7b006"
  },
  "episode": 3,
  "episodeTitle": "The Night Before Christmas",
  "episodeReleaseDate": "December 6, 1941",
  "year": 1941,
  "network": "CBS",
  "length": "00:00",
  "videoUrl": "",
  "thumbnail": "",
  "description": "It's Christmas Eve. Jerry sees a present wrapped in the shape of cheese.",
  "director": [
    "William Hanna",
    "Joseph Barbera"
  ]
},
{
  "_id": {
    "$oid": "65b243b5611329c79ed7b007"
  },
  "episode": 4,
  "episodeTitle": "Fraidy Cat",
  "episodeReleaseDate": "January 17, 1942",
  "year": 1942,
  "network": "CBS",
  "length": "00:00",
  "videoUrl": "",
  "thumbnail": "",
  "description": "On the radio, Tom listens to 'The Witching Hour' that tells scary stories that almost give Tom a heart attack. After seeing Tom's reaction to the radio show, Jerry schemes a way to scare Tom. He moves everything in the house to make it seem like a ghost is in the house. Jerry does everything he can to give Tom a good spook. Tom gets so scared by all the strange things going on that he faints. Later, he finds out that Jerry was the one behind all this, so he chases him around the house. Accidentally, Tom attacks Mammy instead of Jerry, and she, once again, throws him out of the house.",
  "director": [
    "William Hanna",
    "Joseph Barbera"
  ]
},
{
  "_id": {
    "$oid": "65b243b5611329c79ed7b008"
  },
  "episode": 5,
  "episodeTitle": "Dog Trouble",
  "episodeReleaseDate": "April 18, 1942",
  "year": 1942,
  "network": "CBS",
  "length": "00:00",
  "videoUrl": "",
  "thumbnail": "",
  "description": "Tom is chasing Jerry again, and they run into a bull dog. The bull dog gets angry, and starts to chase Tom AND Jerry.",
  "director": [
    "William Hanna",
    "Joseph Barbera"
  ]
}]