[
  {
    "label": "Tom and Jerry",
    "id": 1,
    "episodes": [
      {
        "episode": 1,
        "episodeTitle": "Puss Gets The Boot",
        "episodeReleaseDate": "February 10, 1940",
        "year": 1940,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/dAhzHIBS#fBDqMDcsw-eDAyIWT6pWDG13I-VpxJ5OIWEfG8rmf-Y",
        "thumbnail": "",
        "description": "Tom chases Jerry all over their house, while Jerry foils Tom's plans to catch him. Tom breaks a lot of things in the house, while chasing Jerry, but that's when Mammy steps in. Mammy is Tom's owner. She tells him that if he breaks one more thing in the house, she's going to throw him outside. So, Jerry knocks over a lot of things in the house to make Mammy think Tom did it, and kick him outside. Tom tries his hardest to keep all these things from falling, so he won't be thrown outside.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 2,
        "episodeTitle": "The Midnight Snack",
        "episodeReleaseDate": "July 19, 1941",
        "year": 1941,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/BQgjmbRQ#6uaUmjmZcufXoF-2XU3rDI0VPiCx1-NsKC5-krNFABc",
        "thumbnail": "",
        "description": "Jerry decides to have a midnight snack. And what better than to have some nice, fresh cheese! He takes some from the fridge, but before he can eat it, Tom chases him for it. After breaking a lot of things, when chasing Jerry, Mammy hears the noise and comes down in a huff. Scared, Tom throws Jerry into the fridge to hide him. A bit later, Mammy finds Jerry in the fridge. She gets really angry, and throws Tom of out of the house. While Mammy is doing that, Jerry grabs the cheese, and finally eats it.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 3,
        "episodeTitle": "The Night Before Christmas",
        "episodeReleaseDate": "December 6, 1941",
        "year": 1941,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/NJgCxZBJ#iM250i8G-QodEgtAV8jFL-1_XiC8wPVWefp2-Jz9Rqs",
        "thumbnail": "",
        "description": "It's Christmas Eve. Jerry sees a present wrapped in the shape of cheese.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 4,
        "episodeTitle": "Fraidy Cat",
        "episodeReleaseDate": "January 17, 1942",
        "year": 1942,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/YR4ElBoB#AWC9DMZKOnbqDPEZ06FyMfAFK6khDcIyuk4ego4MHIo",
        "thumbnail": "",
        "description": "On the radio, Tom listens to 'The Witching Hour' that tells scary stories that almost give Tom a heart attack. After seeing Tom's reaction to the radio show, Jerry schemes a way to scare Tom. He moves everything in the house to make it seem like a ghost is in the house. Jerry does everything he can to give Tom a good spook. Tom gets so scared by all the strange things going on that he faints. Later, he finds out that Jerry was the one behind all this, so he chases him around the house. Accidentally, Tom attacks Mammy instead of Jerry, and she, once again, throws him out of the house.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 5,
        "episodeTitle": "Dog Trouble",
        "episodeReleaseDate": "April 18, 1942",
        "year": 1942,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/1dRHDSZA#ah9IuoeRb2eEe38Zz6zj5N22epUc-b9pTh_es5DZb7U",
        "thumbnail": "",
        "description": "Tom is chasing Jerry again, and they run into a bull dog. The bull dog gets angry, and starts to chase Tom AND Jerry.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 6,
        "episodeTitle": "Puss N' Toots",
        "episodeReleaseDate": "May 30, 1942",
        "year": 1942,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/EV5HXLQB#jglwDI1jSeQf9Mub1W-26mrqsUB-GVtSpw1u5HRgWGY",
        "thumbnail": "",
        "description": "Mammy brings home a cute little kitten who just happens to be a girl. Immediately when Tom sees the kitten, he is smitten. Tom tries to act cool around the kitten, and he gives her presents (such as fish). Jerry wants to ruin this.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 7,
        "episodeTitle": "The Bowling Alley-Cat",
        "episodeReleaseDate": "July 18, 1942",
        "year": 1942,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/8BZixCLB#FLruLFT4Igf9k89VnDFfcEzDKYcsLBJ5r3FAdkkqgt0",
        "thumbnail": "",
        "description": "Tom and Jerry are at the bowling alley. Tom, repeatedly, tries to run over Jerry with his ball. He misses Jerry every time he rolls. Jerry gets back at him by putting the bowling ball on his foot, tying it to his tail, making it hit him when it rolls, etc.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 8,
        "episodeTitle": "Fine Feathered Friend",
        "episodeReleaseDate": "October 10, 1942",
        "year": 1942,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/wYZywZoD#OZRzdxbKvb6NceU_JadVva17hkrrGSdvnsXdocLE_i0",
        "thumbnail": "",
        "description": "Tom chases Jerry on a farm, and Jerry hides by a hen. The hen is startled by Tom, so she hits him hard. Jerry dresses himself as a chick, and acts like he's one of the hen's. The rest of the chicks think Jerry is just another one of them. While Tom runs away from the hen, Jerry settles in by the mother and her chicks.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 9,
        "episodeTitle": "Sufferin' Cats!",
        "episodeReleaseDate": "January 16, 1943",
        "year": 1943,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/0ZpilAqI#8a0XLVG921PFiAoWynEtItyXv495ETsC9Qao1nPFtX8",
        "thumbnail": "",
        "description": "Jerry is being chased into an alley, and is seen by an alley cat. The alley cat wants to eat him, but Tom steps in, and says that's his mouse. The two cats fight each other for Jerry, as he runs away trying to hide. The alley cat says to share the mouse, but Tom wants Jerry all for himself. So, they race to see who will catch Jerry first.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 10,
        "episodeTitle": "The Lonesome Mouse",
        "episodeReleaseDate": "May 20, 1943",
        "year": 1943,
        "network": "CBS",
        "length": "",
        "videoUrl": "https://mega.nz/embed/xZh3SZgA#Zjhx8b2KkCnENYcVuqEABdeVUNenP1uU0QsvSBe53tA",
        "thumbnail": "",
        "description": "After being framed by Jerry for breaking something, Tom is thrown out of the house by Mammy. Jerry is overjoyed that he has finally won. He sleeps in Tom's bed, drinks his milk, and makes himself comfortable in Tom's place. After a while, Jerry gets really bored and lonely over the fact that no one is chasing him. There's nothing to do. So, Jerry goes outside to find Tom, and Mammy screams for Tom to get the mouse out of the house. Tom chases Jerry all over the house for pretend to satisfy Mammy. Once Tom claims his territory again, Jerry comes back and makes Tom angry. And the chase starts all over again. Jerry is glad to have the excitement back.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 11,
        "episodeTitle": "The Yankee Doodle Mouse",
        "episodeReleaseDate": "June 26, 1943",
        "year": 1943,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is attacking Jerry with everything that's in the house. He throws vases, paper airplanes, lamps, and anything he can get his hands on to get Jerry. Basically, it's like a war is going on. Jerry retaliates by using a cheese grater, and using fireworks to fight Tom back with. (I.E. Yankee Doodle Mouse) They do the same thing fighting back and forth for the rest of the episode. It ends with Jerry winning the battle, as he blows up Tom using the fireworks, turning him into an American Flag.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 12,
        "episodeTitle": "Baby Puss",
        "episodeReleaseDate": "December 25, 1943",
        "year": 1943,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A little girl is dollying up Tom to make him look like a baby cat. Jerry laughs at him, prompting Tom to chase him around the house into a dollhouse. Jerry dresses up like a doll to escape from Tom, without him noticing. Jerry shows the alley cats from outside the way Tom looks, and they laugh and make fun of him. The alley cats come in the house, and dress Tom in diapers and REALLY make him look like a baby. That's when the little girl appears, and makes the alley cats leave in a hurry. The little girl continues to turn Tom into a baby cat, while Jerry and the alley cats watch while laughing at him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 13,
        "episodeTitle": "The Zoot Cat",
        "episodeReleaseDate": "February 26, 1944",
        "year": 1944,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom gives Jerry, as a present to a girl cat he really likes. The girl doesn't accept the gift, and Tom goes back to the house with a pout. He hears on the radio about a zoot suit. Tom cuts out and sews together a very tight and nice-looking suit. He goes back to the girl cat's house, and as soon as she sees Tom's new suave look, she swoons. Tom acts like Charles Boyer, and he makes the girl fall in love with him. Jerry sees he has to ruin this. He does something to anger Tom, which makes him chase Jerry around the house, and tripped into a fishbowl. The suit shrinks to Jerry's size, and Jerry wears it. He takes Tom's place, and acts like a mini Charles Boyer to the girl cat.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 14,
        "episodeTitle": "The Million Dollar Cat",
        "episodeReleaseDate": "May 6, 1944",
        "year": 1944,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The usual chase is going on between Tom and Jerry, until a letter arrives. Tom reads it and finds out that he inherited one million dollars by one of his uncles! He cheers in happiness, until Jerry reads it, and points out one detail that Tom missed. Tom can't harm any living thing - not even a mouse! Jerry rejoices the inheritance because since Tom is not allowed to hurt any living thing, it means he can get away with doing anything he wants without Tom fighting back. Jerry proceeds to torture Tom by taking advantage of his new life, sleeping in his bed and eating all of his food. Finally, after Tom loses his breakfast and gets a pad of butter in the eye, he loses it and begins to beat up Jerry. He then says, 'Gee, I'm throwing away a million dollars... BUT I'M HAPPY!!'",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 15,
        "episodeTitle": "The Bodyguard",
        "episodeReleaseDate": "July 22, 1944",
        "year": 1944,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "In a heroic effort, Jerry rescues Spike from the dogcatcher. Spike thanks him by telling him to whistle whenever he needs help if Tom chases him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 16,
        "episodeTitle": "Puttin' On The Dog",
        "episodeReleaseDate": "October 28, 1944",
        "year": 1944,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom chases Jerry right into a dog pound. Jerry makes himself comfortable once there, knowing that Tom will never follow him in. Tom thinks of something, though. He puts on a dog mask, and acts like a dog, going into the pound. After chasing Jerry for a while, he tells all the dogs that Tom's really a cat under the mask. All of the dogs chase Tom out of the pound.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 17,
        "episodeTitle": "Mouse Trouble",
        "episodeReleaseDate": "November 23, 1944",
        "year": 1944,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom starts to read a book called 'How to catch a Mouse'. Although, the traps are set for Jerry... the clever mouse thwarts Tom's plan to catch him, and Tom goes through all the traps in a brutal way.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 18,
        "episodeTitle": "The Mouse Comes To Dinner",
        "episodeReleaseDate": "May 5, 1945",
        "year": 1945,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom hits Jerry with a hammer, and is used as a servant for his new girlfriend. Tom dresses Jerry up as a waiter, and makes him do whatever he says. Jerry starts to fight with Tom, and Tom does the same. His girlfriend is turned off by all this. So she leaves, as the cat and mouse go back to the usual fighting.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 19,
        "episodeTitle": "Mouse In Manhattan",
        "episodeReleaseDate": "July 7, 1945",
        "year": 1945,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry decides to move out of the country, and into the big city. He writes a note for Tom, telling him about his departure. He arrives in the city to have bad luck everywhere. He is chased by traffic, chased by cats, hit with different things, and is shot at by the police. Jerry knows that the city is just not for him. He goes back to the country, and tears the note he wrote for Tom to shreds. It's good to be home.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 20,
        "episodeTitle": "Tee For Two",
        "episodeReleaseDate": "July 21, 1945",
        "year": 1945,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom and Jerry are at a golf course. Tom uses Jerry as a tee. After playing atrociously, and getting hit with a ton of golf balls, he is attacked by everything on and off the course. Jerry, of course, does whatever he can to get back at Tom for using him as a tee.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 21,
        "episodeTitle": "Flirty Birdy",
        "episodeReleaseDate": "September 22, 1945",
        "year": 1945,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom has Jerry caught. He is just ready to eat him, when an eagle comes in, and takes Jerry away.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 22,
        "episodeTitle": "Quite Please!",
        "episodeReleaseDate": "December 22, 1945",
        "year": 1945,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "After Tom chases Jerry around the house, and makes a ton of noise, a grumpy Spike tells Tom that if he hears one more thing, he will do his worst.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 23,
        "episodeTitle": "Springtime For Thomas",
        "episodeReleaseDate": "March 30, 1946",
        "year": 1946,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is in love with his new girlfriend, a white cat. He makes her feel special, as he gives her little kisses, etc. Mischievous little Jerry thinks of something to break up the new couple. He writes a fake letter to an alley cat, telling him that the white cat has fallen in love with him. Once the alley cat sees Tom with her, trouble stirs.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 24,
        "episodeTitle": "The Milky Waif",
        "episodeReleaseDate": "May, 18, 1946",
        "year": 1946,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A lost baby mouse is found by Jerry. His name is Nibbles. He's always hungry, and eating anything he can get his teeth into. Jerry takes care of the baby, while he does his best to keep him far away from Tom. But Nibbles' hunger gets the better of him, when he proceeds to drink Tom's milk. Tom chases Nibbles around the house, as Jerry tries to save him, repeatedly.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 25,
        "episodeTitle": "Trap Happy",
        "episodeReleaseDate": "June 29, 1946",
        "year": 1946,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "When Tom loses his patience with chasing Jerry constantly, he hires a mouse exterminator (Butch) to get rid of Jerry once and for all. Once Butch arrives, everything goes according to plan... but not for long. Jerry quickly gains the upper hand, backfiring all capture attempts upon both Tom and Butch.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 26,
        "episodeTitle": "Solid Serrenade",
        "episodeReleaseDate": "August 31, 1946",
        "year": 1946,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's a moonlit night, and Tom wants to impress a cute female kitten (Toodles). So he brings a guitar, ties up Spike, the one guarding Toodles' property, and plays a serenade for Toodles. Unfortunately for Jerry, who happens to dwell close by, the serenading disturbs his sleep. More annoyed than ever, he decides to do all he can to ruin Tom's night.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 27,
        "episodeTitle": "Cat Fishin'",
        "episodeReleaseDate": "February 22, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's beautiful day at a lake... one that's surrounded by a fence that's plastered all over with 'keep out' and 'no fishing' signs. Not to mention the bulldog (Spike) who guards it. But that doesn't stop Tom, as he takes a chance by sneaking in to go fishing anyway, using Jerry as live bait...",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 28,
        "episodeTitle": "Part Time Pal",
        "episodeReleaseDate": "March 15, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is told by his owner, Mammy Two-Shoes, to guard the refrigerator for the night and keep Jerry away from it, or else he'll be thrown out of the house. Upon hearing this, Jerry outwits Tom, but goes too far... to a point where Tom falls into a barrel of cider and gets drunk. The drunk Tom is nice to Jerry, but makes a mess in the kitchen, among other things that are against Mammy's orders. So Jerry does his best to snap Tom out of it before the cat gets into some serious trouble with Mammy.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 29,
        "episodeTitle": "The Cat Concerto",
        "episodeReleaseDate": "April 26, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "In this episode, Tom plays as a concert pianist who plays beautifully, but keeps getting interrupted when Jerry is inside of the piano, making Tom hit the wrong keys. Throughout the episode, Tom tries to squash Jerry by hitting the keys he's on.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 30,
        "episodeTitle": "Dr. Jekyll and Mr. Mouse",
        "episodeReleaseDate": "June 14, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry drinks a potion that makes him grow super-strong. He decides to go after Tom because this time, he's stronger. Once the potion wears off, Tom drinks some of it himself and grows bigger and super-strong. But he then immediately shrinks to half the size of Jerry, then to the size of an ant, and runs away from Jerry, who proceeds to chase him with a fly-swatter.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 31,
        "episodeTitle": "Salt Water Tabby",
        "episodeReleaseDate": "July 12, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While Tom woos a female cat at the beach, Jerry tries to disrupt his fun by playing pranks on him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 32,
        "episodeTitle": "A Mouse In The House",
        "episodeReleaseDate": "August 30, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mammy Two-Shoes is sick and tired of Jerry, period. So she enlists both Tom and Butch to catch him, saying that whichever cat is successful in the capture gets to stay in the house, and whoever fails gets kicked out along with Jerry.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 33,
        "episodeTitle": "The Invisible Mouse",
        "episodeReleaseDate": "September 27, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is chasing Jerry as usual, when Jerry dives into a bottle of ink to hide. Not noticing, Tom dashes off in which he thinks is the direction the mouse went. When Jerry emerges from the bottle, he finds the bottom half of his body invisible! He then realized that the ink he was in is invisible ink, so he covers his whole body in it and goes after Tom, planning on giving him a good scare.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 34,
        "episodeTitle": "Kitty Foiled",
        "episodeReleaseDate": "June 1, 1948",
        "year": 1948,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom has finally caught Jerry and is about to eat him. But the house canary can't bare that and comes to Jerry's rescue. With that, Tom goes after the both of them, but the teamwork between Jerry and the canary outdoes Tom completely.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 35,
        "episodeTitle": "The Truce Hurts",
        "episodeReleaseDate": "July 17, 1948",
        "year": 1948,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tired of fighting, Tom, Jerry, and Spike sign a truce. Now, they protect each other, sleep next to one another, and so on. Until a big steak gets dropped by their house, that's when they start to fight over who gets the bigger share.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 36,
        "episodeTitle": "Old Rockin' Chair Tom",
        "episodeReleaseDate": "September 18, 1948",
        "year": 1948,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mammy Two-Shoes is being 'attacked' by Jerry again, so she once more orders Tom to get rid of him. When he epically fails once again, Mammy decides that Tom is too old to work in the mouse-catching business anymore, and brings in a younger, faster, and more hyper cat named Lightning that disposes of Jerry in an instant. Proud of the new cat, Mammy tells him to take good care of Tom, and goes to bed. But when Lightning frames Tom for raiding the refrigerator, Tom gets kicked out of the house, as well. So both Tom and Jerry come up with a plan to get rid of Lightning once and for all.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 37,
        "episodeTitle": "Professor Tom",
        "episodeReleaseDate": "October 30, 1948",
        "year": 1948,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is doing his best to teach a younger cat how to catch a mouse, but the youngster isn't able to focus very well. When Tom finally tells the young cat to do a test run by catching Jerry, the little one determinedly sets off. But Jerry sees that the young cat likes mice despite his teachings, and takes advantage of this and uses it against Tom.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 38,
        "episodeTitle": "Mouse Cleaning",
        "episodeReleaseDate": "December 11, 1948",
        "year": 1948,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "As soon as Mammy finishes cleaning the house, in come Tom and Jerry to mess it all up. She cleans up the house again, but tells Tom that if he creates another mess, when she comes back from the store, he's going to have to leave. Jerry sees his chance to get Tom out of the house..",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 39,
        "episodeTitle": "Polka-Dot Puss",
        "episodeReleaseDate": "February 26, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mammy Two-Shoes is about to put Tom out for the night, but since there's a lightning storm going on, Tom fakes being sick in order to stay in. Mammy falls for it, and allows Tom to sleep indoors. Tom is delighted that his trick worked, but Jerry is annoyed at this, so he paints red dots all over Tom's face to make him actually look sick. Tom falls for this, so he succumbs to letting Jerry take care of him... in quite a brutal way.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 40,
        "episodeTitle": "The Little Orphan",
        "episodeReleaseDate": "April 30, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "An orphan mouse comes and joins Tom and Jerry for Thanksgiving Dinner. Nibbles is always hungry, so he eats everything in sight. An angry Tom chases him around the house, while Jerry tries to help Nibbles hide.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 41,
        "episodeTitle": "Hatch Up Your Troubles",
        "episodeReleaseDate": "May 14, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A woodpecker egg falls from its nest, and rolls to Jerry's door. It hatches, and Jerry puts it back in its nest. The woodpecker follows Jerry back to his hole, and that's when it goes over by Tom..",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 42,
        "episodeTitle": "Heavenly Puss",
        "episodeReleaseDate": "July 9, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom gets killed by a piano, and starts to float up to Heaven. But he doesn't get to go in, because he's been trying to get Jerry all these years. The only way for him to get into Heaven is to have Jerry sign a piece of paper, stating as an apology. If Jerry doesn't sign it.. then Tom's going down under.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 43,
        "episodeTitle": "The Cat And The Mermouse",
        "episodeReleaseDate": "September 3, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom drowns in a lake, and goes to the bottom. There, he finds a mermouse, and then tries to capture it and eat it. The mermouse doesn't give in so easily, though.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 44,
        "episodeTitle": "Love That Pup",
        "episodeReleaseDate": "October 1, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mistakenly grabbing Spike's son, instead of Jerry, Spike lets Tom have it. Jerry makes himself comfortable over by Spike, while Tom tries to devise a plan to get Jerry without having either of the dogs notice.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 45,
        "episodeTitle": "Jerry's Diary",
        "episodeReleaseDate": "October 22, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "After getting tired of chasing Jerry, Tom sits down and finds Jerry's Diary. He opens it and starts to read it, showing clips of past episodes.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 46,
        "episodeTitle": "Tennis Chumps",
        "episodeReleaseDate": "December 10, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom competes against Butch in a tennis tournament. Bad luck keeps happening throughout the game, though. Jerry sees and figures he can use this to his advantage. He uses tricks though, as he competes against both Tom and Butch.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 47,
        "episodeTitle": "Little Quacker",
        "episodeReleaseDate": "January 7, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom finds a duck egg, and decides to have it for breakfast. The egg hatches as Tom prepares to cook it. As soon as Jerry sees this, he swipes the duck away from Tom just in time. Tom starts to chase Jerry for the duck, while they foil Tom's plans to have duck soup.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 48,
        "episodeTitle": "Saturday Evening Puss",
        "episodeReleaseDate": "January 14, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mammy wants to go out to dinner. So, Tom invites his friends over a party, and they use Jerry as a needle on a record player. After Jerry escapes from this, he gets back at Tom and his friends, by giving them some of their own medicine.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 49,
        "episodeTitle": "Texas Tom",
        "episodeReleaseDate": "March 11, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "In this episode, Tom is a cowboy, and he uses Jerry like a lackey. He does all sorts of things to impress a female cat. Jerry gets mad, and releases a big bull on Tom that Tom runs away from in a hurry, and makes the female cat un-impressed.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 50,
        "episodeTitle": "Jerry And The Lion",
        "episodeReleaseDate": "April 8, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "On the radio, Tom and Jerry hear that a lion is loose in their area. Frightened, Tom gets on his hunting outfit and gets out a rifle. A bit later, Jerry finds the lion in their house, and learns that the lion's harmless, but he asks the lion to play a trick on Tom to make him look like he's ferocious.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 51,
        "episodeTitle": "Safety Second",
        "episodeReleaseDate": "July 1, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's the 4th of July, and Nibbles is looking forward to an exciting day with lots of fireworks. But Jerry is against this, considering safety first. Nibbles still sneaks out the fireworks anyway, which eventually leads to an explosive battle against Tom.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 52,
        "episodeTitle": "The Hollywood Bowl",
        "episodeReleaseDate": "September 16, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "At the Hollywood Bowl, Tom is the conductor. Jerry wants to help out, and he gets in Tom's sleeves to help conduct. Tom denies his assistance again and again. Jerry gets mad and starts hitting Tom with instruments, and Tom does the same.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 53,
        "episodeTitle": "The Framed Cat",
        "episodeReleaseDate": "October 21, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry gets blamed for stealing a piece of chicken, and Mammy makes Tom chase him. Mad, Jerry goes and frames Tom by saying that he stole Spike's bone, which leaves to even more frame-ups..",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 54,
        "episodeTitle": "Cue Ball Cat",
        "episodeReleaseDate": "November 25, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The setting is of a poolroom. Tom uses Jerry as a ball, as he hits with his cue stick, trying to get into each of the pockets, and so on. Jerry does the same to get back at him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 55,
        "episodeTitle": "Casanova Cat",
        "episodeReleaseDate": "January 6, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is using Jerry for many embarrassing things to, once again, impress a female cat. Jerry gets frustrated and calls Butch to get the female cat. Tom and Butch duke it out to see who will get to have her.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 56,
        "episodeTitle": "Jerry And The Goldfish",
        "episodeReleaseDate": "March 3, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry and the house's goldfish, Goldy, become best friends. Tom hears a recipe on the radio for fish, and he instantly grabs Goldy to cook him. Jerry saves him, and Tom chases both of them around the house..",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 57,
        "episodeTitle": "Jerry's Cousin",
        "episodeReleaseDate": "April 7, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "There are beaten up alley cats in the street. This is the work of Muscles Mouse, Jerry's cousin. He calls up Jerry, and tells him that he wants to help take care of Tom for him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 58,
        "episodeTitle": "Sleepy-Time Tom",
        "episodeReleaseDate": "May 26, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom and his friends come back from partying all night early in the morning at the crack of dawn. Mammy caught Tom sleeping on the window, and she's mad at Tom, because she had to keep Jerry away from the food. Tom is very tired and can do nothing but sleep, but Mammy says if she catches Tom sleeping on the job, he will be thrown out. Jerry overhears this, and tries to make Tom fall asleep every time.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 59,
        "episodeTitle": "His Mouse Friday",
        "episodeReleaseDate": "July 7, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Lost at sea on a life raft, Tom washes ashore on a deserted island. He meets up with Jerry, posing as a cannibal.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 60,
        "episodeTitle": "Slicked-Up Pup",
        "episodeReleaseDate": "September 8, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Spike is giving his son, Tyke, a bath. Once finished, he leaves him on the porch to go get some meat. But he doesn't go too far before Tom and Jerry's chasing antics cause Tyke to fall into the mud and get dirty again. After ordering Tom to clean him up, Spike warns him that if he's dirty again by the time he gets back, he'll pound him to pieces. Upon hearing this, Jerry attempts to get Tyke dirty himself in order to get Tom into trouble.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 61,
        "episodeTitle": "Nit-Witty Kitty",
        "episodeReleaseDate": "October 6, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is chasing Jerry as usual, with Mammy Two-Shoes cheering him on. But when she attempts to crush Jerry herself by whacking him with a broom, she accidentally whacks Tom on the head instead. This causes Tom to suffer a case of amnesia, and he begins to act like a mouse. So both Jerry and Mammy individually try to cure him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 62,
        "episodeTitle": "Cat Napping",
        "episodeReleaseDate": "December 8, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's a sunny day, and Tom walks out into the backyard with some lemonade and a pillow, ready to relax to his heart's content on a hammock. But when he finds out that Jerry is already sleeping there, he tosses him off. A fight then ensures for who gets the hammock.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 63,
        "episodeTitle": "The Flying Cat",
        "episodeReleaseDate": "January 12, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is chasing both Jerry and the house canary, but the two go out of reach by taking refuge in the canary's birdhouse. Tom tries everything to get up to them, but everything fails, ultimately resulting in him crashing through the whole house. When he comes out the other side, he has pink lace attached to him. Tom realizes that he can actually use the lace as wings to fly; a new weapon in his quest to get to Jerry and the canary...",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 64,
        "episodeTitle": "The Duck Doctor",
        "episodeReleaseDate": "February 16, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's the time of year for ducks to be migrating, and little Quacker is among them. Unfortunately, Tom is out hunting ducks, and manages to shoot Quacker's wing, causing him to fall. Delighted, Tom goes after him, but Jerry saves him, doing his best to heal Quacker's wound and keep him safe from Tom at the same time.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 65,
        "episodeTitle": "The Two Mouseketeers",
        "episodeReleaseDate": "March 15, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Given the responsibilities, by the tyrannical King, of guarding the grand banquet table, Tom is confronted by the sudden appearance of Jerry and Tuffy (Nibbles), the Mouseketeers.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 66,
        "episodeTitle": "Smitten Kitten",
        "episodeReleaseDate": "April 12, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry gets annoyed when he sees Tom fall for a female cat once again. With the help of his evil self, he remembers all of Tom's past relationships and all of the trouble that they caused him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 67,
        "episodeTitle": "Triplet Trouble",
        "episodeReleaseDate": "April 19, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mammy receives 3 kittens to take care of. Tom gets to take care of them, but what Mammy doesn't know is that the three cats are evil. Tom knows they're evil, but Mammy thinks they are 'little angels'. She goes out to buy cream for them. This gives them the chance to torture Tom. Later, they see Jerry and decides to torture him too. Tom & Jerry then decide to work together and get back on the cats.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 68,
        "episodeTitle": "",
        "episodeReleaseDate": "",
        "year": 1,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "",
        "director": ["William Hanna", "Joseph Barbera"]
      }
    ]
  },

  {
    "label": "Masha and the Bear",
    "id": 2,
    "episodes": [
      {
        "episode": 101,
        "episodeTitle": "Episode Masa",
        "year": 2007,
        "network": "Annimacord",
        "length": "13:45",
        "videoURL": "example.com/video.mp4",
        "thumbnail": "example.com/image.jpg",
        "description": "description example",
        "director": "Oleg Kuzovkov"
      }
    ]
  },
  {
    "label": "Lucky Luke",
    "id": 3,
    "episodes": [
      {
        "episode": 1,
        "episodeTitle": "Luke on west",
        "year": 2007,
        "network": "Annimacord",
        "length": "13:45",
        "videoURL": "example.com/video.mp4",
        "thumbnail": "example.com/image.jpg",
        "description": "description example",
        "director": "Oleg Kuzovkov"
      }
    ]
  }
]
