[
  {
    "label": "Tom and Jerry",
    "id": 1,
    "generalThumbnail": "https://wallpapers.com/images/featured-full/tom-and-jerry-2f5fbl2k3wwi31aq.jpg",
    "episodes": [
      {
        "episode": 1,
        "episodeTitle": "Puss Gets The Boot",
        "episodeReleaseDate": "February 10, 1940",
        "year": 1940,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "//watchadsontape.com/get_video?id=gvOeWqlzWBH42P&expires=1742810317&ip=F0qWKRWNFI9XKxR&token=Wx-ntsOCIc_W&stream=1",
        "thumbnail": "https://thumb.tapecontent.net/thumb/gvOeWqlzWBH42P/qjAXrL1dyRUzPpm.jpg",
        "description": "Tom chases Jerry all over their house, while Jerry foils Tom's plans to catch him. Tom breaks a lot of things in the house, while chasing Jerry, but that's when Mammy steps in. Mammy is Tom's owner. She tells him that if he breaks one more thing in the house, she's going to throw him outside. So, Jerry knocks over a lot of things in the house to make Mammy think Tom did it, and kick him outside. Tom tries his hardest to keep all these things from falling, so he won't be thrown outside.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 2,
        "episodeTitle": "The Midnight Snack",
        "episodeReleaseDate": "July 19, 1941",
        "year": 1941,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "//watchadsontape.com/get_video?id=D4dOYOp2Q2Ukr1q&expires=1742810392&ip=F0qWKRWNFI9XKxR&token=GrFFfDhHwZpA&stream=1",
        "thumbnail": "https://thumb.tapecontent.net/thumb/D4dOYOp2Q2Ukr1q/djzRjLAG6JHkya4.jpg",
        "description": "Jerry decides to have a midnight snack. And what better than to have some nice, fresh cheese! He takes some from the fridge, but before he can eat it, Tom chases him for it. After breaking a lot of things, when chasing Jerry, Mammy hears the noise and comes down in a huff. Scared, Tom throws Jerry into the fridge to hide him. A bit later, Mammy finds Jerry in the fridge. She gets really angry, and throws Tom of out of the house. While Mammy is doing that, Jerry grabs the cheese, and finally eats it.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 3,
        "episodeTitle": "The Night Before Christmas",
        "episodeReleaseDate": "December 6, 1941",
        "year": 1941,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/NJgCxZBJ#iM250i8G-QodEgtAV8jFL-1_XiC8wPVWefp2-Jz9Rqs",
        "thumbnail": "https://thumb.tapecontent.net/thumb/plJqkDvxjaFrrDm/YwvljaoOKysvXMG.jpg",
        "description": "It's Christmas Eve. Jerry sees a present wrapped in the shape of cheese.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 4,
        "episodeTitle": "Fraidy Cat",
        "episodeReleaseDate": "January 17, 1942",
        "year": 1942,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/YR4ElBoB#AWC9DMZKOnbqDPEZ06FyMfAFK6khDcIyuk4ego4MHIo",
        "thumbnail": "https://thumb.tapecontent.net/thumb/DzvyadQvPQck7V8/3k38L1VlJ0Cddbx.jpg",
        "description": "On the radio, Tom listens to 'The Witching Hour' that tells scary stories that almost give Tom a heart attack. After seeing Tom's reaction to the radio show, Jerry schemes a way to scare Tom. He moves everything in the house to make it seem like a ghost is in the house. Jerry does everything he can to give Tom a good spook. Tom gets so scared by all the strange things going on that he faints. Later, he finds out that Jerry was the one behind all this, so he chases him around the house. Accidentally, Tom attacks Mammy instead of Jerry, and she, once again, throws him out of the house.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 5,
        "episodeTitle": "Dog Trouble",
        "episodeReleaseDate": "April 18, 1942",
        "year": 1942,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/1dRHDSZA#ah9IuoeRb2eEe38Zz6zj5N22epUc-b9pTh_es5DZb7U",
        "thumbnail": "https://thumb.tapecontent.net/thumb/D2gK9837z8Sdm2/jgom98qK9vszOze.jpg",
        "description": "Tom is chasing Jerry again, and they run into a bull dog. The bull dog gets angry, and starts to chase Tom AND Jerry.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 6,
        "episodeTitle": "Puss N' Toots",
        "episodeReleaseDate": "May 30, 1942",
        "year": 1942,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/EV5HXLQB#jglwDI1jSeQf9Mub1W-26mrqsUB-GVtSpw1u5HRgWGY",
        "thumbnail": "https://thumb.tapecontent.net/thumb/m3jpoX8v97cb90o/XjxM1KlJ2mUD9zx.jpg",
        "description": "Mammy brings home a cute little kitten who just happens to be a girl. Immediately when Tom sees the kitten, he is smitten. Tom tries to act cool around the kitten, and he gives her presents (such as fish). Jerry wants to ruin this.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 7,
        "episodeTitle": "The Bowling Alley-Cat",
        "episodeReleaseDate": "July 18, 1942",
        "year": 1942,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/8BZixCLB#FLruLFT4Igf9k89VnDFfcEzDKYcsLBJ5r3FAdkkqgt0",
        "thumbnail": "https://thumb.tapecontent.net/thumb/qM9oBX2d2OuapA/Jq30vJvlZycj4Br.jpg",
        "description": "Tom and Jerry are at the bowling alley. Tom, repeatedly, tries to run over Jerry with his ball. He misses Jerry every time he rolls. Jerry gets back at him by putting the bowling ball on his foot, tying it to his tail, making it hit him when it rolls, etc.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 8,
        "episodeTitle": "Fine Feathered Friend",
        "episodeReleaseDate": "October 10, 1942",
        "year": 1942,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/wYZywZoD#OZRzdxbKvb6NceU_JadVva17hkrrGSdvnsXdocLE_i0",
        "thumbnail": "https://thumb.tapecontent.net/thumb/PJ1ZRk22Q9tRM7/K02xVzo4KVI01Mr.jpg",
        "description": "Tom chases Jerry on a farm, and Jerry hides by a hen. The hen is startled by Tom, so she hits him hard. Jerry dresses himself as a chick, and acts like he's one of the hen's. The rest of the chicks think Jerry is just another one of them. While Tom runs away from the hen, Jerry settles in by the mother and her chicks.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 9,
        "episodeTitle": "Sufferin' Cats!",
        "episodeReleaseDate": "January 16, 1943",
        "year": 1943,
        "network": "CBS",
        "length": "00:00",
        "videoUrl": "https://mega.nz/embed/0ZpilAqI#8a0XLVG921PFiAoWynEtItyXv495ETsC9Qao1nPFtX8",
        "thumbnail": "https://thumb.tapecontent.net/thumb/vlraOw9mWOf4kg9/2KQMvjdGJosZb4P.jpg",
        "description": "Jerry is being chased into an alley, and is seen by an alley cat. The alley cat wants to eat him, but Tom steps in, and says that's his mouse. The two cats fight each other for Jerry, as he runs away trying to hide. The alley cat says to share the mouse, but Tom wants Jerry all for himself. So, they race to see who will catch Jerry first.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 10,
        "episodeTitle": "The Lonesome Mouse",
        "episodeReleaseDate": "May 20, 1943",
        "year": 1943,
        "network": "CBS",
        "length": "",
        "videoUrl": "https://mega.nz/embed/xZh3SZgA#Zjhx8b2KkCnENYcVuqEABdeVUNenP1uU0QsvSBe53tA",
        "thumbnail": "https://thumb.tapecontent.net/thumb/KWbGk0Gy3rcgAj/dRj9lq6LKxskJ6Z.jpg",
        "description": "After being framed by Jerry for breaking something, Tom is thrown out of the house by Mammy. Jerry is overjoyed that he has finally won. He sleeps in Tom's bed, drinks his milk, and makes himself comfortable in Tom's place. After a while, Jerry gets really bored and lonely over the fact that no one is chasing him. There's nothing to do. So, Jerry goes outside to find Tom, and Mammy screams for Tom to get the mouse out of the house. Tom chases Jerry all over the house for pretend to satisfy Mammy. Once Tom claims his territory again, Jerry comes back and makes Tom angry. And the chase starts all over again. Jerry is glad to have the excitement back.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 11,
        "episodeTitle": "The Yankee Doodle Mouse",
        "episodeReleaseDate": "June 26, 1943",
        "year": 1943,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is attacking Jerry with everything that's in the house. He throws vases, paper airplanes, lamps, and anything he can get his hands on to get Jerry. Basically, it's like a war is going on. Jerry retaliates by using a cheese grater, and using fireworks to fight Tom back with. (I.E. Yankee Doodle Mouse) They do the same thing fighting back and forth for the rest of the episode. It ends with Jerry winning the battle, as he blows up Tom using the fireworks, turning him into an American Flag.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 12,
        "episodeTitle": "Baby Puss",
        "episodeReleaseDate": "December 25, 1943",
        "year": 1943,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A little girl is dollying up Tom to make him look like a baby cat. Jerry laughs at him, prompting Tom to chase him around the house into a dollhouse. Jerry dresses up like a doll to escape from Tom, without him noticing. Jerry shows the alley cats from outside the way Tom looks, and they laugh and make fun of him. The alley cats come in the house, and dress Tom in diapers and REALLY make him look like a baby. That's when the little girl appears, and makes the alley cats leave in a hurry. The little girl continues to turn Tom into a baby cat, while Jerry and the alley cats watch while laughing at him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 13,
        "episodeTitle": "The Zoot Cat",
        "episodeReleaseDate": "February 26, 1944",
        "year": 1944,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom gives Jerry, as a present to a girl cat he really likes. The girl doesn't accept the gift, and Tom goes back to the house with a pout. He hears on the radio about a zoot suit. Tom cuts out and sews together a very tight and nice-looking suit. He goes back to the girl cat's house, and as soon as she sees Tom's new suave look, she swoons. Tom acts like Charles Boyer, and he makes the girl fall in love with him. Jerry sees he has to ruin this. He does something to anger Tom, which makes him chase Jerry around the house, and tripped into a fishbowl. The suit shrinks to Jerry's size, and Jerry wears it. He takes Tom's place, and acts like a mini Charles Boyer to the girl cat.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 14,
        "episodeTitle": "The Million Dollar Cat",
        "episodeReleaseDate": "May 6, 1944",
        "year": 1944,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The usual chase is going on between Tom and Jerry, until a letter arrives. Tom reads it and finds out that he inherited one million dollars by one of his uncles! He cheers in happiness, until Jerry reads it, and points out one detail that Tom missed. Tom can't harm any living thing - not even a mouse! Jerry rejoices the inheritance because since Tom is not allowed to hurt any living thing, it means he can get away with doing anything he wants without Tom fighting back. Jerry proceeds to torture Tom by taking advantage of his new life, sleeping in his bed and eating all of his food. Finally, after Tom loses his breakfast and gets a pad of butter in the eye, he loses it and begins to beat up Jerry. He then says, 'Gee, I'm throwing away a million dollars... BUT I'M HAPPY!!'",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 15,
        "episodeTitle": "The Bodyguard",
        "episodeReleaseDate": "July 22, 1944",
        "year": 1944,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "In a heroic effort, Jerry rescues Spike from the dogcatcher. Spike thanks him by telling him to whistle whenever he needs help if Tom chases him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 16,
        "episodeTitle": "Puttin' On The Dog",
        "episodeReleaseDate": "October 28, 1944",
        "year": 1944,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom chases Jerry right into a dog pound. Jerry makes himself comfortable once there, knowing that Tom will never follow him in. Tom thinks of something, though. He puts on a dog mask, and acts like a dog, going into the pound. After chasing Jerry for a while, he tells all the dogs that Tom's really a cat under the mask. All of the dogs chase Tom out of the pound.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 17,
        "episodeTitle": "Mouse Trouble",
        "episodeReleaseDate": "November 23, 1944",
        "year": 1944,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom starts to read a book called 'How to catch a Mouse'. Although, the traps are set for Jerry... the clever mouse thwarts Tom's plan to catch him, and Tom goes through all the traps in a brutal way.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 18,
        "episodeTitle": "The Mouse Comes To Dinner",
        "episodeReleaseDate": "May 5, 1945",
        "year": 1945,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom hits Jerry with a hammer, and is used as a servant for his new girlfriend. Tom dresses Jerry up as a waiter, and makes him do whatever he says. Jerry starts to fight with Tom, and Tom does the same. His girlfriend is turned off by all this. So she leaves, as the cat and mouse go back to the usual fighting.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 19,
        "episodeTitle": "Mouse In Manhattan",
        "episodeReleaseDate": "July 7, 1945",
        "year": 1945,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry decides to move out of the country, and into the big city. He writes a note for Tom, telling him about his departure. He arrives in the city to have bad luck everywhere. He is chased by traffic, chased by cats, hit with different things, and is shot at by the police. Jerry knows that the city is just not for him. He goes back to the country, and tears the note he wrote for Tom to shreds. It's good to be home.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 20,
        "episodeTitle": "Tee For Two",
        "episodeReleaseDate": "July 21, 1945",
        "year": 1945,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom and Jerry are at a golf course. Tom uses Jerry as a tee. After playing atrociously, and getting hit with a ton of golf balls, he is attacked by everything on and off the course. Jerry, of course, does whatever he can to get back at Tom for using him as a tee.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 21,
        "episodeTitle": "Flirty Birdy",
        "episodeReleaseDate": "September 22, 1945",
        "year": 1945,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom has Jerry caught. He is just ready to eat him, when an eagle comes in, and takes Jerry away.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 22,
        "episodeTitle": "Quite Please!",
        "episodeReleaseDate": "December 22, 1945",
        "year": 1945,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "After Tom chases Jerry around the house, and makes a ton of noise, a grumpy Spike tells Tom that if he hears one more thing, he will do his worst.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 23,
        "episodeTitle": "Springtime For Thomas",
        "episodeReleaseDate": "March 30, 1946",
        "year": 1946,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is in love with his new girlfriend, a white cat. He makes her feel special, as he gives her little kisses, etc. Mischievous little Jerry thinks of something to break up the new couple. He writes a fake letter to an alley cat, telling him that the white cat has fallen in love with him. Once the alley cat sees Tom with her, trouble stirs.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 24,
        "episodeTitle": "The Milky Waif",
        "episodeReleaseDate": "May, 18, 1946",
        "year": 1946,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A lost baby mouse is found by Jerry. His name is Nibbles. He's always hungry, and eating anything he can get his teeth into. Jerry takes care of the baby, while he does his best to keep him far away from Tom. But Nibbles' hunger gets the better of him, when he proceeds to drink Tom's milk. Tom chases Nibbles around the house, as Jerry tries to save him, repeatedly.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 25,
        "episodeTitle": "Trap Happy",
        "episodeReleaseDate": "June 29, 1946",
        "year": 1946,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "When Tom loses his patience with chasing Jerry constantly, he hires a mouse exterminator (Butch) to get rid of Jerry once and for all. Once Butch arrives, everything goes according to plan... but not for long. Jerry quickly gains the upper hand, backfiring all capture attempts upon both Tom and Butch.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 26,
        "episodeTitle": "Solid Serrenade",
        "episodeReleaseDate": "August 31, 1946",
        "year": 1946,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's a moonlit night, and Tom wants to impress a cute female kitten (Toodles). So he brings a guitar, ties up Spike, the one guarding Toodles' property, and plays a serenade for Toodles. Unfortunately for Jerry, who happens to dwell close by, the serenading disturbs his sleep. More annoyed than ever, he decides to do all he can to ruin Tom's night.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 27,
        "episodeTitle": "Cat Fishin'",
        "episodeReleaseDate": "February 22, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's beautiful day at a lake... one that's surrounded by a fence that's plastered all over with 'keep out' and 'no fishing' signs. Not to mention the bulldog (Spike) who guards it. But that doesn't stop Tom, as he takes a chance by sneaking in to go fishing anyway, using Jerry as live bait...",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 28,
        "episodeTitle": "Part Time Pal",
        "episodeReleaseDate": "March 15, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is told by his owner, Mammy Two-Shoes, to guard the refrigerator for the night and keep Jerry away from it, or else he'll be thrown out of the house. Upon hearing this, Jerry outwits Tom, but goes too far... to a point where Tom falls into a barrel of cider and gets drunk. The drunk Tom is nice to Jerry, but makes a mess in the kitchen, among other things that are against Mammy's orders. So Jerry does his best to snap Tom out of it before the cat gets into some serious trouble with Mammy.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 29,
        "episodeTitle": "The Cat Concerto",
        "episodeReleaseDate": "April 26, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "In this episode, Tom plays as a concert pianist who plays beautifully, but keeps getting interrupted when Jerry is inside of the piano, making Tom hit the wrong keys. Throughout the episode, Tom tries to squash Jerry by hitting the keys he's on.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 30,
        "episodeTitle": "Dr. Jekyll and Mr. Mouse",
        "episodeReleaseDate": "June 14, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry drinks a potion that makes him grow super-strong. He decides to go after Tom because this time, he's stronger. Once the potion wears off, Tom drinks some of it himself and grows bigger and super-strong. But he then immediately shrinks to half the size of Jerry, then to the size of an ant, and runs away from Jerry, who proceeds to chase him with a fly-swatter.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 31,
        "episodeTitle": "Salt Water Tabby",
        "episodeReleaseDate": "July 12, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While Tom woos a female cat at the beach, Jerry tries to disrupt his fun by playing pranks on him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 32,
        "episodeTitle": "A Mouse In The House",
        "episodeReleaseDate": "August 30, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mammy Two-Shoes is sick and tired of Jerry, period. So she enlists both Tom and Butch to catch him, saying that whichever cat is successful in the capture gets to stay in the house, and whoever fails gets kicked out along with Jerry.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 33,
        "episodeTitle": "The Invisible Mouse",
        "episodeReleaseDate": "September 27, 1947",
        "year": 1947,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is chasing Jerry as usual, when Jerry dives into a bottle of ink to hide. Not noticing, Tom dashes off in which he thinks is the direction the mouse went. When Jerry emerges from the bottle, he finds the bottom half of his body invisible! He then realized that the ink he was in is invisible ink, so he covers his whole body in it and goes after Tom, planning on giving him a good scare.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 34,
        "episodeTitle": "Kitty Foiled",
        "episodeReleaseDate": "June 1, 1948",
        "year": 1948,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom has finally caught Jerry and is about to eat him. But the house canary can't bare that and comes to Jerry's rescue. With that, Tom goes after the both of them, but the teamwork between Jerry and the canary outdoes Tom completely.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 35,
        "episodeTitle": "The Truce Hurts",
        "episodeReleaseDate": "July 17, 1948",
        "year": 1948,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tired of fighting, Tom, Jerry, and Spike sign a truce. Now, they protect each other, sleep next to one another, and so on. Until a big steak gets dropped by their house, that's when they start to fight over who gets the bigger share.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 36,
        "episodeTitle": "Old Rockin' Chair Tom",
        "episodeReleaseDate": "September 18, 1948",
        "year": 1948,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mammy Two-Shoes is being 'attacked' by Jerry again, so she once more orders Tom to get rid of him. When he epically fails once again, Mammy decides that Tom is too old to work in the mouse-catching business anymore, and brings in a younger, faster, and more hyper cat named Lightning that disposes of Jerry in an instant. Proud of the new cat, Mammy tells him to take good care of Tom, and goes to bed. But when Lightning frames Tom for raiding the refrigerator, Tom gets kicked out of the house, as well. So both Tom and Jerry come up with a plan to get rid of Lightning once and for all.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 37,
        "episodeTitle": "Professor Tom",
        "episodeReleaseDate": "October 30, 1948",
        "year": 1948,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is doing his best to teach a younger cat how to catch a mouse, but the youngster isn't able to focus very well. When Tom finally tells the young cat to do a test run by catching Jerry, the little one determinedly sets off. But Jerry sees that the young cat likes mice despite his teachings, and takes advantage of this and uses it against Tom.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 38,
        "episodeTitle": "Mouse Cleaning",
        "episodeReleaseDate": "December 11, 1948",
        "year": 1948,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "As soon as Mammy finishes cleaning the house, in come Tom and Jerry to mess it all up. She cleans up the house again, but tells Tom that if he creates another mess, when she comes back from the store, he's going to have to leave. Jerry sees his chance to get Tom out of the house..",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 39,
        "episodeTitle": "Polka-Dot Puss",
        "episodeReleaseDate": "February 26, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mammy Two-Shoes is about to put Tom out for the night, but since there's a lightning storm going on, Tom fakes being sick in order to stay in. Mammy falls for it, and allows Tom to sleep indoors. Tom is delighted that his trick worked, but Jerry is annoyed at this, so he paints red dots all over Tom's face to make him actually look sick. Tom falls for this, so he succumbs to letting Jerry take care of him... in quite a brutal way.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 40,
        "episodeTitle": "The Little Orphan",
        "episodeReleaseDate": "April 30, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "An orphan mouse comes and joins Tom and Jerry for Thanksgiving Dinner. Nibbles is always hungry, so he eats everything in sight. An angry Tom chases him around the house, while Jerry tries to help Nibbles hide.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 41,
        "episodeTitle": "Hatch Up Your Troubles",
        "episodeReleaseDate": "May 14, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A woodpecker egg falls from its nest, and rolls to Jerry's door. It hatches, and Jerry puts it back in its nest. The woodpecker follows Jerry back to his hole, and that's when it goes over by Tom..",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 42,
        "episodeTitle": "Heavenly Puss",
        "episodeReleaseDate": "July 9, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom gets killed by a piano, and starts to float up to Heaven. But he doesn't get to go in, because he's been trying to get Jerry all these years. The only way for him to get into Heaven is to have Jerry sign a piece of paper, stating as an apology. If Jerry doesn't sign it.. then Tom's going down under.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 43,
        "episodeTitle": "The Cat And The Mermouse",
        "episodeReleaseDate": "September 3, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom drowns in a lake, and goes to the bottom. There, he finds a mermouse, and then tries to capture it and eat it. The mermouse doesn't give in so easily, though.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 44,
        "episodeTitle": "Love That Pup",
        "episodeReleaseDate": "October 1, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mistakenly grabbing Spike's son, instead of Jerry, Spike lets Tom have it. Jerry makes himself comfortable over by Spike, while Tom tries to devise a plan to get Jerry without having either of the dogs notice.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 45,
        "episodeTitle": "Jerry's Diary",
        "episodeReleaseDate": "October 22, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "After getting tired of chasing Jerry, Tom sits down and finds Jerry's Diary. He opens it and starts to read it, showing clips of past episodes.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 46,
        "episodeTitle": "Tennis Chumps",
        "episodeReleaseDate": "December 10, 1949",
        "year": 1949,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom competes against Butch in a tennis tournament. Bad luck keeps happening throughout the game, though. Jerry sees and figures he can use this to his advantage. He uses tricks though, as he competes against both Tom and Butch.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 47,
        "episodeTitle": "Little Quacker",
        "episodeReleaseDate": "January 7, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom finds a duck egg, and decides to have it for breakfast. The egg hatches as Tom prepares to cook it. As soon as Jerry sees this, he swipes the duck away from Tom just in time. Tom starts to chase Jerry for the duck, while they foil Tom's plans to have duck soup.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 48,
        "episodeTitle": "Saturday Evening Puss",
        "episodeReleaseDate": "January 14, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mammy wants to go out to dinner. So, Tom invites his friends over a party, and they use Jerry as a needle on a record player. After Jerry escapes from this, he gets back at Tom and his friends, by giving them some of their own medicine.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 49,
        "episodeTitle": "Texas Tom",
        "episodeReleaseDate": "March 11, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "In this episode, Tom is a cowboy, and he uses Jerry like a lackey. He does all sorts of things to impress a female cat. Jerry gets mad, and releases a big bull on Tom that Tom runs away from in a hurry, and makes the female cat un-impressed.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 50,
        "episodeTitle": "Jerry And The Lion",
        "episodeReleaseDate": "April 8, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "On the radio, Tom and Jerry hear that a lion is loose in their area. Frightened, Tom gets on his hunting outfit and gets out a rifle. A bit later, Jerry finds the lion in their house, and learns that the lion's harmless, but he asks the lion to play a trick on Tom to make him look like he's ferocious.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 51,
        "episodeTitle": "Safety Second",
        "episodeReleaseDate": "July 1, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's the 4th of July, and Nibbles is looking forward to an exciting day with lots of fireworks. But Jerry is against this, considering safety first. Nibbles still sneaks out the fireworks anyway, which eventually leads to an explosive battle against Tom.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 52,
        "episodeTitle": "The Hollywood Bowl",
        "episodeReleaseDate": "September 16, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "At the Hollywood Bowl, Tom is the conductor. Jerry wants to help out, and he gets in Tom's sleeves to help conduct. Tom denies his assistance again and again. Jerry gets mad and starts hitting Tom with instruments, and Tom does the same.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 53,
        "episodeTitle": "The Framed Cat",
        "episodeReleaseDate": "October 21, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry gets blamed for stealing a piece of chicken, and Mammy makes Tom chase him. Mad, Jerry goes and frames Tom by saying that he stole Spike's bone, which leaves to even more frame-ups..",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 54,
        "episodeTitle": "Cue Ball Cat",
        "episodeReleaseDate": "November 25, 1950",
        "year": 1950,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The setting is of a poolroom. Tom uses Jerry as a ball, as he hits with his cue stick, trying to get into each of the pockets, and so on. Jerry does the same to get back at him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 55,
        "episodeTitle": "Casanova Cat",
        "episodeReleaseDate": "January 6, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is using Jerry for many embarrassing things to, once again, impress a female cat. Jerry gets frustrated and calls Butch to get the female cat. Tom and Butch duke it out to see who will get to have her.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 56,
        "episodeTitle": "Jerry And The Goldfish",
        "episodeReleaseDate": "March 3, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry and the house's goldfish, Goldy, become best friends. Tom hears a recipe on the radio for fish, and he instantly grabs Goldy to cook him. Jerry saves him, and Tom chases both of them around the house..",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 57,
        "episodeTitle": "Jerry's Cousin",
        "episodeReleaseDate": "April 7, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "There are beaten up alley cats in the street. This is the work of Muscles Mouse, Jerry's cousin. He calls up Jerry, and tells him that he wants to help take care of Tom for him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 58,
        "episodeTitle": "Sleepy-Time Tom",
        "episodeReleaseDate": "May 26, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom and his friends come back from partying all night early in the morning at the crack of dawn. Mammy caught Tom sleeping on the window, and she's mad at Tom, because she had to keep Jerry away from the food. Tom is very tired and can do nothing but sleep, but Mammy says if she catches Tom sleeping on the job, he will be thrown out. Jerry overhears this, and tries to make Tom fall asleep every time.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 59,
        "episodeTitle": "His Mouse Friday",
        "episodeReleaseDate": "July 7, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Lost at sea on a life raft, Tom washes ashore on a deserted island. He meets up with Jerry, posing as a cannibal.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 60,
        "episodeTitle": "Slicked-Up Pup",
        "episodeReleaseDate": "September 8, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Spike is giving his son, Tyke, a bath. Once finished, he leaves him on the porch to go get some meat. But he doesn't go too far before Tom and Jerry's chasing antics cause Tyke to fall into the mud and get dirty again. After ordering Tom to clean him up, Spike warns him that if he's dirty again by the time he gets back, he'll pound him to pieces. Upon hearing this, Jerry attempts to get Tyke dirty himself in order to get Tom into trouble.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 61,
        "episodeTitle": "Nit-Witty Kitty",
        "episodeReleaseDate": "October 6, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is chasing Jerry as usual, with Mammy Two-Shoes cheering him on. But when she attempts to crush Jerry herself by whacking him with a broom, she accidentally whacks Tom on the head instead. This causes Tom to suffer a case of amnesia, and he begins to act like a mouse. So both Jerry and Mammy individually try to cure him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 62,
        "episodeTitle": "Cat Napping",
        "episodeReleaseDate": "December 8, 1951",
        "year": 1951,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's a sunny day, and Tom walks out into the backyard with some lemonade and a pillow, ready to relax to his heart's content on a hammock. But when he finds out that Jerry is already sleeping there, he tosses him off. A fight then ensures for who gets the hammock.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 63,
        "episodeTitle": "The Flying Cat",
        "episodeReleaseDate": "January 12, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is chasing both Jerry and the house canary, but the two go out of reach by taking refuge in the canary's birdhouse. Tom tries everything to get up to them, but everything fails, ultimately resulting in him crashing through the whole house. When he comes out the other side, he has pink lace attached to him. Tom realizes that he can actually use the lace as wings to fly; a new weapon in his quest to get to Jerry and the canary...",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 64,
        "episodeTitle": "The Duck Doctor",
        "episodeReleaseDate": "February 16, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's the time of year for ducks to be migrating, and little Quacker is among them. Unfortunately, Tom is out hunting ducks, and manages to shoot Quacker's wing, causing him to fall. Delighted, Tom goes after him, but Jerry saves him, doing his best to heal Quacker's wound and keep him safe from Tom at the same time.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 65,
        "episodeTitle": "The Two Mouseketeers",
        "episodeReleaseDate": "March 15, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Given the responsibilities, by the tyrannical King, of guarding the grand banquet table, Tom is confronted by the sudden appearance of Jerry and Tuffy (Nibbles), the Mouseketeers.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 66,
        "episodeTitle": "Smitten Kitten",
        "episodeReleaseDate": "April 12, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry gets annoyed when he sees Tom fall for a female cat once again. With the help of his evil self, he remembers all of Tom's past relationships and all of the trouble that they caused him.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 67,
        "episodeTitle": "Triplet Trouble",
        "episodeReleaseDate": "April 19, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mammy receives 3 kittens to take care of. Tom gets to take care of them, but what Mammy doesn't know is that the three cats are evil. Tom knows they're evil, but Mammy thinks they are 'little angels'. She goes out to buy cream for them. This gives them the chance to torture Tom. Later, they see Jerry and decides to torture him too. Tom & Jerry then decide to work together and get back on the cats.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 68,
        "episodeTitle": "Little Runaway",
        "episodeReleaseDate": "June 14, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "When a baby seal escapes from the circus, it's befriended by Jerry. Tom hears that there's a big reward for the return of the seal, so he tries to catch it, with Jerry doing his best to protect it.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 69,
        "episodeTitle": "Fit To Be Tied",
        "episodeReleaseDate": "July 26, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Spike steps on a tack while walking and is really hurt (he didn't know it was just a little tack). Jerry hears him, and helps take out the tack. To thank him, Spike gives Jerry a bell to ring whenever he's in trouble.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 70,
        "episodeTitle": "Push-Button Kitty",
        "episodeReleaseDate": "September 6, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mammy is tired of Tom being lazy and just lying around doing nothing. She receives a package that she's been wanting. It's a robot-cat. Tom first thinks it's just a robot, but when he sees how the cat got rid of Jerry, he feels sad and leaves. Every time Jerry tries to get back in the house, the robot throws him out. Jerry has a plan to keep the robot busy. He puts three wind-up mice in the house. The robot causes all kinds of destruction while trying to catch the mice. Mammy sees what a mess he made, and she begs Tom to come back.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 71,
        "episodeTitle": "Cruise Cat",
        "episodeReleaseDate": "October 18, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A luxury cruise ship is bound for Honolulu, Hawaii, and Tom is the ship's mascot. The captain tells Tom that if he sees one mouse on the ship, he'll be kicked off and replaced with a new mascot. Of course, Jerry, who's on vacation, then discovers the ship and decides to climb aboard.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 72,
        "episodeTitle": "The Dog House",
        "episodeReleaseDate": "November 29, 1952",
        "year": 1952,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A luxury cruise ship is bound for Honolulu, Hawaii, and Tom is the ship's mascot. The captain tells Tom that if he sees one mouse on the ship, he'll be kicked off and replaced with a new mascot. Of course, Jerry, who's on vacation, then discovers the ship and decides to climb aboard.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 73,
        "episodeTitle": "The Missing Mouse",
        "episodeReleaseDate": "January 10, 1953",
        "year": 1953,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The radio reports that a white mouse, having swallowed enough explosives to blow up the city, has escaped from a lab.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 74,
        "episodeTitle": "Jerry And Jumbo",
        "episodeReleaseDate": "February 21, 1953",
        "year": 1953,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's nighttime, and a circus train is passing through town. But a baby elephant is sleeping too close to the edge of the car he's in, and tumbles out, rolls down the hill, into a house, and right into Tom's basket. Not noticing out of tiredness, Tom curls up on top of the elephant, who's under the blanket. It manages to make a quick getaway, then sucks up Tom's milk with it's truck. Thinking it was Jerry, Tom marches into the kitchen. Jerry was actually drinking milk, but is wasn't Tom's. Still thinking he did it, Tom prepares to smash his bowl on him, when the elephant comes to his rescue. The two then hide from Tom in the closet, and decide to play a trick on him; Jerry paints the elephant to make him look like a super-sized version of himself...",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 75,
        "episodeTitle": "Johann Mouse",
        "episodeReleaseDate": "March 21, 1953",
        "year": 1953,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The narrator tells the story of a waltzing mouse named Johann (Jerry) who lives in Vienna in Johann Strauss' home. Tom tries to catch Jerry each time he's dancing to Johann Strauss' piano music, but when a day arrives in which Johann Strauss is absent, Tom decides to learn how to play the piano in order to raise his chances of catching Jerry...",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 76,
        "episodeTitle": "That's My Pup!",
        "episodeReleaseDate": "April 25, 1953",
        "year": 1953,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Spike is teaching his son Tyke the facts of life about being a dog. One lesson is chasing cats and Tom happens to be the object lesson of the day.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 77,
        "episodeTitle": "Just Ducky",
        "episodeReleaseDate": "September 5, 1953",
        "year": 1,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Six eggs of a mother duck have just hatched. Delighted, the mother duck goes swimming, with five of her ducklings close behind. But unfortunately, the last duckling can't swim, and becomes sad.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 78,
        "episodeTitle": "Two Little Indians",
        "episodeReleaseDate": "October 17, 1953",
        "year": 1953,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Scoutmaster Jerry has his hands full with two little orphans from the Bide a Wee Mouse Home. Outfitted in Indian feathers and diapers , the two involve Jerry and the sleeping Spike in a hair-raising battle with Tom.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 79,
        "episodeTitle": "Life With Tom",
        "episodeReleaseDate": "November 21, 1953",
        "year": 1953,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 80,
        "episodeTitle": "Puppy Tale",
        "episodeReleaseDate": "January 23, 1954",
        "year": 1954,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry resues a sackful of puppies from a storm swollen river and on of the pups follows Jerry home. Tom, being the cat that he is, doesn't want a dog around.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 81,
        "episodeTitle": "Posse Cat",
        "episodeReleaseDate": "January 30, 1954",
        "year": 1954,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The ranch cook tells Tom that he won't be getting any more food unless he gets rid of Jerry.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 82,
        "episodeTitle": "Hic-cup Pup",
        "episodeReleaseDate": "April 17, 1954",
        "year": 1954,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom accidentally gives Tyke the hiccups when he, also accidentally, awakens him from his nap. Spike is not pleased about this, and won't stop standing over Tom until he gets rid of Tyke's hiccups.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 83,
        "episodeTitle": "Little School Mouse",
        "episodeReleaseDate": "May 29, 1954",
        "year": 1954,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "After being chased by Tom once again, Professor Jerry escapes into his classroom (mouse hole). Once there, he proceeds to teach his only student, Nibbles, how to outwit a cat. And the subject for the lesson is none other than Tom.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 84,
        "episodeTitle": "Baby Butch",
        "episodeReleaseDate": "March 14, 1954",
        "year": 1954,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Butch is going shopping... in an ally. He finds what he can in a garbage cans, and takes them with him. But a bottle of fresh milk on a doorstep catches his attention, and goes over to get it. But Tom opens the door and takes the milk before Butch can. Butch then sees a cooked chicken on the windowsill, and proceeds to takes that, only to have the window slammed shut on his fingers before he can. Determined, Butch dresses up as a hungry baby in order to get into the house and snatch the chicken, as well as all of the other delicious foods that could be there...",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 85,
        "episodeTitle": "Mice Follies",
        "episodeReleaseDate": "September 4, 1954",
        "year": 1954,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "It's icy fun in the kitchen, as Jerry and Nibbles turn the floor into an ice-skating rink by freezing overflowing faucets.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 86,
        "episodeTitle": "Neapolitan Mouse",
        "episodeReleaseDate": "October 2, 1954",
        "year": 1954,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While touring Naples, Italy, Tom and Jerry are befriended by an Italian mouse named Topo, a champion of justice who helps his new friends fight off some tough Italian dogs.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 87,
        "episodeTitle": "Downhearted Duckling",
        "episodeReleaseDate": "November 13, 1954",
        "year": 1954,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The little duckling is sad, because he just read 'the ugly duckling'. He cries because the duck looks just like him. Jerry hears him crying and tries to make him feel better. But no matter what, the duck thinks he looks ugly.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 88,
        "episodeTitle": "Pet Peeve",
        "episodeReleaseDate": "November 20, 1954",
        "year": 1954,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Husband and wife tell Tom and Spike that, due to the high cost of feeding them, one must go, and the one who catches Jerry will stay.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 89,
        "episodeTitle": "Touche, Pussy Cat",
        "episodeReleaseDate": "December 18, 1954",
        "year": 1954,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 90,
        "episodeTitle": "Southbound Duckling",
        "episodeReleaseDate": "March 12, 1955",
        "year": 1955,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Stubborn Quacker, convinced this time that all ducks go south for the winter, refuses to stay home like his domestic buddies even though he can't fly. To complicate things Tom is hungry for a duck meal.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 91,
        "episodeTitle": "Pup On A Picnic",
        "episodeReleaseDate": "April 30, 1955",
        "year": 1955,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Spike and his son, Tyke, are on a picnic, but happen do have one in the same place in which Tom and Jerry's chasing antics are going on, and the two groups collide. It's then an array of food fight fun as Tom, Jerry, Spike, and Tyke, as well as an army of ants, vie for control of the picnic basket.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 92,
        "episodeTitle": "Mouse For Sale",
        "episodeReleaseDate": "May 21, 1955",
        "year": 1955,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "With white mice being the new rage, Tom paints Jerry white and sells him for a bucketful of money, which he hides under the carpet back home.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 93,
        "episodeTitle": "Designs On Jerry",
        "episodeReleaseDate": "September 2, 1955",
        "year": 1955,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Knowing that he can make a lot of money this way, Tom designs the ultimate mouse trap. But after he goes to sleep, the mouse in his blueprints comes to life and warns Jerry about the upcoming threat that this mouse trap puts upon him...",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 94,
        "episodeTitle": "Tom And Cherie",
        "episodeReleaseDate": "September 9, 1955",
        "year": 1955,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Hopelessly in love with a female mouse named Lilli, Jerry uses Nibbles as an errand boy to send letters back and forth between them. Unfortunately for Nibbles, he has to deal with Tom during these back-and-forth trips.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 95,
        "episodeTitle": "Smarty Cat",
        "episodeReleaseDate": "October 14, 1955",
        "year": 1955,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom and his alley cat palls are going through home movies, and Jerry wants to watch them, too. But Tom and his buddies don't want him around and toss him out the window. Annoyed, Jerry decides to get back at them by waking up Spike and angering him by showing him how he's depicted as a big goof in those movies.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 96,
        "episodeTitle": "Pecos Pest",
        "episodeReleaseDate": "November 11, 1955",
        "year": 1955,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Jerry gets a telegram from his Uncle Pecos that says that he's going to spend the night with him before his big debut on TV. Arriving quickly, he gives Jerry a demonstration of his guitar skills. But when one of his guitar's strings snap, he fearlessly walks up to Tom and pulls one of his whiskers to replace it. Annoyed at first, Tom soon becomes afraid of Uncle Pecos, whose guitar strings are always snapping, and it's always Tom's whiskers that he targets to replace them.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 97,
        "episodeTitle": "That's My Mommy",
        "episodeReleaseDate": "November 19, 1955",
        "year": 1955,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A duck egg rolls out of its nest and on Tom. When the egg cracks, it sees Tom, and it thinks Tom is his mother.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 98,
        "episodeTitle": "The Flying Sorceress",
        "episodeReleaseDate": "January 27, 1956",
        "year": 1956,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "When Tom is scolded by his owner for always breaking things while chasing Jerry, he decides to get a job. He soon finds one that sounds good to him, but it turns out to be the job of a witch's cat. After a scary ride on the witch's broom, Tom gets the job and the witch goes to bed. Tom then decides to take the broom himself, and ride it back home to give Jerry a good scare.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 99,
        "episodeTitle": "The Egg And Jerry",
        "episodeReleaseDate": "March 23, 1956",
        "year": 1956,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A CinemaScope remake of the 1949 episode, Hatch Up Your Troubles.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 100,
        "episodeTitle": "Bussy Buddies",
        "episodeReleaseDate": "May, 4 1956",
        "year": 1956,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A prequel to the upcoming Tot Watchers. This concerns Jeannie, the babysitter whose primary interest is talking on the phone.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 101,
        "episodeTitle": "Muscle Beach Tom",
        "episodeReleaseDate": "September 7, 1956",
        "year": 1956,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom and Butch both try to impress a female cat with their muscle building abilities, with not only each other, but Jerry, for competition.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 102,
        "episodeTitle": "Down Beat Bear",
        "episodeReleaseDate": "October 21, 1956",
        "year": 1956,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom and Jerry hear on the radio about a bear that escaped from the circus who always dances whenever music is playing. When the bear finds it's way to their house, and music starts playing, it takes Tom as it's reluctant dancing partner. Amused by this, Jerry does his best to keep the music going so he can continue to watch Tom get helplessly thrown around by the dancing bear.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 103,
        "episodeTitle": "Blue Cat Blues",
        "episodeReleaseDate": "November 6, 1956",
        "year": 1956,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom is sitting on the railroad tracks, feeling miserable about losing his girlfriend to his rival Butch again. Feeling sad for him, Jerry narrates the whole story as he watches on.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 104,
        "episodeTitle": "Barbecue Brawl",
        "episodeReleaseDate": "December 14, 1956",
        "year": 1956,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Spike's perfect pool-side barbecue with Tyke turns into a disaster when Tom and Jerry come crashing through with their usual chasing antics.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 105,
        "episodeTitle": "Tops With Pops",
        "episodeReleaseDate": "February 22, 1957",
        "year": 1957,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "This is a CinemaScope remake of the 1949 episode, Love That Pup.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 106,
        "episodeTitle": "Timid Tabby",
        "episodeReleaseDate": "April 19, 1957",
        "year": 1957,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "George, Tom's fraidy-cat-look-alike cousin, comes for a visit. Jerry has no knowledge of this, however, so when he sees George freak out upon seeing him, he decides to scare him some more, but not always working as he sometimes gets Tom.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 107,
        "episodeTitle": "Feedin' The Kiddie",
        "episodeReleaseDate": "June 7, 1957",
        "year": 1957,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "This is a CinemaScope remake of the 1949 episode, The Little Orphan.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 108,
        "episodeTitle": "Mucho Mouse",
        "episodeReleaseDate": "September 6, 1957",
        "year": 1957,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Taking place in Spain, Meathead the Cat is ordered by his owner to catch El Magnifico (Jerry) at once, but Meathead says that's impossible because of El Magnifico's world-renowned escaping skills. So the owner decides to call up Tom, the 'Olympic, U.S. and World Champion Mouse Catcher', confident that he will be able to do the job.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 109,
        "episodeTitle": "Tom's Photo Finish",
        "episodeReleaseDate": "November 1, 1957",
        "year": 1957,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Tom frames Spike for stealing food from the fridge only to be caught on film by Jerry. Jerry makes several copies of the photo to try to get Tom in trouble.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 110,
        "episodeTitle": "Happy Go Ducky",
        "episodeReleaseDate": "January 3, 1958",
        "year": 1958,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "When the Easter Bunny leaves an egg for Tom and Jerry, it hatches into Quacker. The little duck insists on swimming in everything in the house.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 111,
        "episodeTitle": "Royal Cat Nap",
        "episodeReleaseDate": "March 7, 1958",
        "year": 1958,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The king is about to take a nap, and tells Tom that if he hears one sound and wakes up, it's off with his head!",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 112,
        "episodeTitle": "The Vanishing Duck",
        "episodeReleaseDate": "May 2, 1958",
        "year": 1958,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Quacker, in his last Tom and Jerry film, plays a singing duck who becomes Jerry's partner in crime when the tow of them discover the delights of vanishing cream.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 113,
        "episodeTitle": "Robin Hoodwinked",
        "episodeReleaseDate": "June 6, 1958",
        "year": 1958,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Daring mice Jerry and Tuffy try to break Robin Hood out of prison, but in order to do that, they have to get past the guard, Tom.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 114,
        "episodeTitle": "Tot Watchers",
        "episodeReleaseDate": "August 1, 1958",
        "year": 1958,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Babysitter Jeannie, still attached to the phone, unintentionally forces Tom and Jerry to take care of the baby, who still keeps getting into mischief.",
        "director": ["William Hanna", "Joseph Barbera"]
      },
      {
        "episode": 115,
        "episodeTitle": "",
        "episodeReleaseDate": "",
        "year": 1,
        "network": "CBS",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "",
        "director": ["William Hanna", "Joseph Barbera"]
      }
    ]
  },

  {
    "label": "Masha and the Bear",
    "id": 2,
    "generalThumbnail": "https://wallpapers.com/images/featured-full/masha-and-the-bear-pictures-j7nwagu3zy119fjn.jpg",
    "episodes": [
      {
        "episode": 101,
        "episodeTitle": "Episode Masa",
        "year": 2007,
        "network": "Annimacord",
        "length": "13:45",
        "videoUrl": "example.com/video.mp4",
        "thumbnail": "example.com/image.jpg",
        "description": "description example",
        "director": "Oleg Kuzovkov"
      }
    ]
  },
  {
    "label": "Lucky Luke",
    "id": 3,
    "generalThumbnail": "https://upload.wikimedia.org/wikipedia/en/0/0e/LuckyLuke2.png?20231102000247",
    "episodes": [
      {
        "episode": 1,
        "episodeTitle": "Luke on west",
        "year": 2007,
        "network": "Annimacord",
        "length": "13:45",
        "videoUrl": "example.com/video.mp4",
        "thumbnail": "example.com/image.jpg",
        "description": "description example",
        "director": "Oleg Kuzovkov"
      }
    ]
  },
  {
    "label": "Johnny Bravo",
    "id": 4,
    "generalThumbnail": "https://wallpapers.com/images/featured-full/johnny-bravo-74fsyoyn5pgw7hey.jpg",
    "episodes": [
      {
        "episode": 1,
        "episodeTitle": "Johnny Bravo",
        "year": 1,
        "network": "",
        "length": "",
        "videoUrl": "example.com/video.mp4",
        "thumbnail": "example.com/image.jpg",
        "description": "description example",
        "director": ""
      }
    ]
  },
  {
    "label": "Dusko Dugousko",
    "id": 5,
    "generalThumbnail": "https://wallpapers.com/images/high/cool-bugs-bunny-nbtf193e27a1w5z1.webp",
    "episodes": [
      {
        "episode": 1,
        "episodeTitle": "Ep. 1",
        "year": 2,
        "network": "",
        "length": "",
        "videoUrl": "example.com/video.mp4",
        "thumbnail": "example.com/image.jpg",
        "description": "description example",
        "director": ""
      }
    ]
  },
  {
    "label": "Chip 'n Dale - Rescue rangers",
    "id": 6,
    "generalThumbnail": "https://wallpapers.com/images/high/chip-n-dale-rescue-rangers-complete-gang-ongbzuuf71xn9gdy.webp",
    "episodes": [
      {
        "episode": 1,
        "episodeTitle": "Piratsy Under the Seas",
        "year": 1989,
        "air date": "March 4",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "In the first episode of the series, the Rescue Rangers discover a sunken pirate ship and a huge cargo of gold, along with a crew of pirate rats who have forgotten about the life above the surface.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 2,
        "episodeTitle": "Catteries Not Included",
        "year": 1989,
        "air date": "March 5",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A little girl (known as Mandy) is looking for her kitten, Spunky, and the Rescue Rangers are on the case. The trail leads to Nimnul's laboratory, where the professor is kidnapping cats and using them to generate lightning bolts by building up a charge of static electricity in their fur.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 3,
        "episodeTitle": "Dale Beside Himself",
        "year": 1989,
        "air date": "March 12",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A trio of shape-changing aliens from the planet Fleeblebrox are vacationing on Earth. When it's time to leave, one of them, Ditz, decides to remain behind by tricking Dale into switching places with him.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 4,
        "episodeTitle": "Flash, the Wonder Dog",
        "year": 1989,
        "air date": "March 19",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "To bring down beloved television star Flash the Wonder Dog, Fat Cat and his henchmen dress up in his costume and perform random acts of badness. Soon, the town is buzzing with bad vibes for Flash and the studio is replacing the canine with his cockatoo sidekick named Conrad. Meanwhile, Dale gets a sobering meeting with his TV hero and finds that Flash is not as brave as he thought he was in real life",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 5,
        "episodeTitle": "Out to Launch",
        "year": 1989,
        "air date": "March 26",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers go to watch the launch of a space plane, but unfortunately Chip and Dale get trapped in a spacesuit in orbit, forcing the other Rangers to attempt a launch of their own.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 6,
        "episodeTitle": "Kiwi's Big Adventure",
        "year": 1989,
        "air date": "April 2",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers lose the Ranger Plane to a tribe of kiwi birds. In their attempt to get it back, Dale pretends to have broken his toe to receive affection from Gadget.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 7,
        "episodeTitle": "Adventures in Squirrelsitting",
        "year": 1989,
        "air date": "April 9",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While trying to recover a stolen statuette  the Maltese Mouse  from Fat Cat, the Rangers accidentally wreak havoc in the home of a squirrel with two daughters. While the mother repairs the damage, the Rangers take care of the girls. The eldest, Tammy, develops a crush on Chip. She decides to prove herself to her hero by sneaking into Fat Cat's hideout and recovering the priceless statuette herself.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 8,
        "episodeTitle": "Pound of the Baskervilles",
        "year": 1989,
        "air date": "April 16",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "MacDuff enlists the Rescue Rangers, with a little help from Sureluck Jones, (a paordy of the fictional sleuth, Sherlock Holmes) a fictional sleuth whom Chip admires from a series of books he reads to find the will that proves the old family mansion rightfully belongs to his master, Roger.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 9,
        "episodeTitle": "Risky Beesness",
        "year": 1989,
        "air date": "April 23",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Irwina Allen, a scientist and rockstar wannabe uses her control of bees to steal a swarm and plot her takeover of the world of rock and roll. The queen bee appeals to Zipper and the other Rangers for help, during which Zipper falls in love with her and is trying to win her affection.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 10,
        "episodeTitle": "Three Men and a Booby",
        "year": 1989,
        "air date": "April 30",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A mad egg collector attempts to collect the egg of a mother Booby Bird, and the rangers attempt to help reunite her with her baby.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 11,
        "episodeTitle": "The Carpetsnaggers",
        "year": 1989,
        "air date": "May 7",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The homes of the wealthy are being robbed by flying carpets under the control of Professor Nimnul.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 12,
        "episodeTitle": "Bearing Up Baby",
        "year": 1989,
        "air date": "May 14",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While on a camping trip, the Rangers find themselves watching over a little boy named Jeremy, who's also being watched over by a friendly Humphrey the Bear, who quickly discovers that he might have gotten more than he bargained for.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 13,
        "episodeTitle": "Parental Discretion Retired",
        "year": 1989,
        "air date": "May 21",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Monty's father Cheddarhead Charlie comes to visit, and tries to help the Rangers stop Fat Cat's latest scheme, but his rash way of doing things are only getting in the way.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 14,
        "episodeTitle": "Rescue Rangers to the Rescue (1)",
        "year": 1989,
        "air date": "September 11",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A criminal mastermind named Aldrin Klordane and his pet cat, Fat Cat, frame aging police detective, Donald Drake, and his canine companion, Plato, for stealing a priceless ruby. While the human police try to get Drake to confess to the crime, a pair of chipmunks named Chip and Dale help Plato find the real culprits.",
        "director": "John Kimball Bob Zamboni Rick Leon & Jamie Mitchell",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 15,
        "episodeTitle": "Rescue Rangers to the Rescue (2)",
        "year": 1989,
        "air date": "September 12",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "In their attempt to get the ruby back, Chip and Dale follow Fat Cat to a Chinese laundry, and later a fishing boat, where they befriend a fat Australian mouse named Monterey Jack and his housefly companion, Zipper (who are on the fishing boat to get the latest shipment of cheese). However the situation gets complicated when Monty becomes enraged at Fat Cat for throwing his house overboard.",
        "director": "John Kimball Bob Zamboni Rick Leon & Jamie Mitchell",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 16,
        "episodeTitle": "Rescue Rangers to the Rescue (3)",
        "year": 1989,
        "air date": "September 13",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While Klordane and Fat Cat head for Glacier Bay, Chip and Dale follow Monterey Jack and Zipper to the home of Monty's old traveling partner Geegaw Hackwrench, hoping to find a vehicle to get them to Glacier Bay, but must deal with Monty's 'cheese attacks' (hypnotic spells that occur whenever Monty sees or smells cheese) and an elaborate security system set up by Geegaw's daughter, Gadget.",
        "director": "John Kimball Bob Zamboni Rick Leon & Jamie Mitchell",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 17,
        "episodeTitle": "Rescue Rangers to the Rescue (4)",
        "year": 1989,
        "air date": "September 14",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers return to the city, where Professor Nimnul has transported a glacier to, so it can be crushed and transported underground. After Klordane breaks Drake out of prison as part of his scheme to frame him for his master plan, the Rangers also find themselves having to save Plato from the animal shelter which gets complicated, when Monty, still obsessed with Fat Cat for destroying his home leaves with Zipper.",
        "director": "John Kimball Bob Zamboni Rick Leon & Jamie Mitchell",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 18,
        "episodeTitle": "Rescue Rangers to the Rescue (5)",
        "year": 1989,
        "air date": "September 15",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers discover Klordane and Nimnul's plot to create an underground earthquake via a giant gelatin mould for robbing a bank, and they are the only ones who can stop them. With both Drake and Plato captured, the Rangers must work together to create a second earthquake to bring in the authorities but must contend with Fat Cat first.",
        "director": "John Kimball Bob Zamboni Rick Leon & Jamie Mitchell",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 19,
        "episodeTitle": "A Lad in a Lamp",
        "year": 1989,
        "air date": "October 3",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Fat Cat attempts to get hold of a magic lamp, but it falls into the hands of Monterey Jack instead. After Monty alienates the other Rangers by his greed, the genie tricks him into switching places, just as Fat Cat finds the lamp.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 20,
        "episodeTitle": "The Luck Stops Here",
        "year": 1989,
        "air date": "October 6",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A failing inventor who believes that all his troubles are due to bad luck alone is aided by the Rangers. However, Gadget learns that the inventor's cat has been sabotaging his inventions.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 21,
        "episodeTitle": "Battle of the Bulge",
        "year": 1989,
        "air date": "October 9",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Monty's weight problem encourages the Rangers to go on diets and to exercise more frequently. Meanwhile, Fat Cat is hiring Jamaican fruit bats to steal jewels for him.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 22,
        "episodeTitle": "Ghost of a Chance",
        "year": 1989,
        "air date": "October 10",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While visiting the Tower of London on a quest to stop Fat Cat, the Rangers meet up with the ghost of one of Monty's ancestors, Sir Colby. Monty then learns that Sir Colby isn't as brave as he's made out to be.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 23,
        "episodeTitle": "An Elephant Never Suspects",
        "year": 1989,
        "air date": "October 11",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers investigate a peanut shortage at the zoo. When the leader of the zoo's elephants accuses the Rangers of stealing the peanuts, the Rangers must find the real thief in order to clear their names.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 24,
        "episodeTitle": "Fake Me to Your Leader",
        "year": 1989,
        "air date": "October 12",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Professor Nimnul uses his Gigantico Gun on some pillbugs, and an unwitting Zipper, as part of his plan to fake an alien attack and extort much gold for 'spaceship fuel'.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 25,
        "episodeTitle": "Last Train to Cashville",
        "year": 1989,
        "air date": "October 13",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "When Dale stays up all night, he's too tired to help the other Rangers with tracking down a stolen toy train the next day and ends up sleepwalking.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 26,
        "episodeTitle": "A Case of Stage Blight",
        "year": 1989,
        "air date": "October 16",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers attend a human opera and discover it is being sabotaged. The culprit is the alligator Sewernose de Bergerac, who plots to replace the lead in the opera.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 27,
        "episodeTitle": "The Case of the Cola Cult",
        "year": 1989,
        "air date": "October 17",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While test-driving the Ranger-mobile, the Rangers stumble across a group of soda-worshipping mice who call themselves the Cola Cult. But it soon becomes clear that the Cult's leaders are exploiting its members, stealing everything they donate, and things get worse when Gadget (who feels that she's losing her engineering edge) joins.",
        "director": "John Kimball & Rick Leon",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 28,
        "episodeTitle": "Throw Mummy From the Train",
        "year": 1989,
        "air date": "October 18",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "At the tomb of King Nutun-Khamun, an archeologist finds the ring to unlock the diamonds of the Sphinx of Inka-dinka-do. His greedy assistant Wexler steals the ring and eludes the mummy assigned to guard it, Hiram. Wexler tries to hide the ring and Dale gets it for a while, putting the Rangers on the case.",
        "director": "John Kimball & Rick Leon",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 29,
        "episodeTitle": "A Wolf in Cheap Clothing",
        "year": 1989,
        "air date": "October 19",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Prof Nimnul is using a shape-shifting device to trade places with a wolf. While Nimnul robs homes as a wolf, the wolf-turned-human experiences the downtown nightlife.",
        "director": "John Kimball & Rick Leon",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 30,
        "episodeTitle": "Robocat",
        "year": 1989,
        "air date": "October 20",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A junkman builds a mechanical guard-cat. When it breaks down, Gadget fixes it and makes it friendly. Fat Cat finds out about this and plots to reprogram the cat for his own ends.",
        "director": "John Kimball & Rick Leon",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 31,
        "episodeTitle": "Does Pavlov Ring a Bell",
        "year": 1989,
        "air date": "November 2",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Professor Nimnul trains lab animals to follow the maze that mimics the city's tunnels in order to use them as a navigation system for his bank-robbing super-rat robot. The team befriends two of them, Sparky and Buzz. Meanwhile, the battle between Chip and Dale for Gadget's attention begins to get ugly.",
        "director": "John Kimball & Rick Leon",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 32,
        "episodeTitle": "Prehysterical Pet",
        "year": 1989,
        "air date": "November 3",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Dale's discovery of a rodent-sized space-travelling stegosaurus is certainly a surprise to the Rangers; and when the diminutive dinosaur suddenly begins to grow in size and lose intelligence, the rangers have to save him.",
        "director": "John Kimball & Rick Leon",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 33,
        "episodeTitle": "A Creep in the Deep",
        "year": 1989,
        "air date": "November 13",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers are spurred into action by a rash of bizarre attacks on seafood shipments and restaurants. After some research, they find that the attacks are being led by a fish by the name of Captain Fin, who has modified a sunken submarine so that it holds water, allowing Captain Fin and his crew to traverse on land.",
        "director": "John Kimball & Rick Leon",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 34,
        "episodeTitle": "Normie's Science Project",
        "year": 1989,
        "air date": "November 14",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Professor Nimnul designs a super-weapon that levels cities with mega-amplified sound. However, his nephew Normie borrows the 'molecular sound amplifier', the main part of the weapon, for the school science project.",
        "director": "John Kimball & Rick Leon",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 35,
        "episodeTitle": "Seer No Evil",
        "year": 1989,
        "air date": "November 15",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While at a carnival, the Rangers meet a fortune-telling moth named Cassandra, who predicts that Chip will be killed 'before the next sun rises'. On learning that one of the carnival members is a crook who is using his monkey accomplice to rob the homes of those people who have won prizes at his booth, the Rangers must find a way to solve the case while keeping Chip out of harm's way.",
        "director": "John Kimball & Rick Leon",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 36,
        "episodeTitle": "Chipwrecked Shipmunks",
        "year": 1989,
        "air date": "November 16",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "When the Rangers are shipwrecked on an island, Gadget and Chip try to find a way off the island before a hurricane hits while Monty and Dale find treasure. The pirate rats then come to the island to search for the treasure that Dale and Monty found.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 37,
        "episodeTitle": "When Mice Were Men",
        "year": 1989,
        "air date": "November 17",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Monty gets invited over Tramplonia, Spain, where he is regarded as a hero for defeating a vicious bull. Truth is, Monty didn't defeat the bull with his bare hands, and that bull is out seeking revenge.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 38,
        "episodeTitle": "Chocolate Chips",
        "year": 1989,
        "air date": "November 20",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While on vacation in the Amazon, a mad, German chocolate lover employs mosquitoes loaded with drugs to make the locals easily hypnotizeable and make them unknowingly work night shifts at his chocolate factory, and Dale is the only member of the Rangers unaffected by the drugs.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 39,
        "episodeTitle": "The Last Leprechaun",
        "year": 1989,
        "air date": "November 21",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers crash-land in Ireland and are tricked by Darby Spree, King of the Leprechauns, into helping him rescue his fellow leprechauns from their enslavement to a banshee.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 40,
        "episodeTitle": "Weather or Not",
        "year": 1989,
        "air date": "November 22",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Professor Nimnul's weather machine vs. Monterey Jack's weather-predicting tail.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 41,
        "episodeTitle": "One-Upsman-Chip",
        "year": 1989,
        "air date": "November 23",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While Fat Cat plots to steal the world's biggest pearl from a tank guarded by a vicious shark, Chip and Dale engage in a war of practical jokes that ends with Dale in Fat Cat's clutches.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 42,
        "episodeTitle": "Shell Shocked",
        "year": 1989,
        "air date": "November 24",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers attempt to enjoy a day at the beach is nearly ruined by Chip's micromanagement style, so Dale is made leader for the day, just before the group discovers that the beach's crabs are having their shells stolen.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 43,
        "episodeTitle": "Love is a Many Splintered Thing",
        "year": 1989,
        "air date": "December 18",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "While fighting two wooden furniture thugs, Monterey Jack gets distracted by a smell that's (for once) not cheese. Rather, it's the smell of perfume from Desiree D'Allure, a female mouse he fell in love with back when he was a globetrotting explorer (and whom he planned to marry, only to get a whiff from a cheese truck and eat himself into a food coma), who comes back into his life and begs him to help her get away from her criminal boyfriend  but Chip thinks the entire thing is a trap.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 44,
        "episodeTitle": "Song of the Night 'n Dale",
        "year": 1989,
        "air date": "December 19",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers' new vehicle, the Ranger Wing, accidentally takes them to the Himalayas, where they come to the aid of the emperor's songbird, Chirp Sing. It appears that the gentle emperor is going insane, while his greedy sister plots to sell the valley to developers. The Rangers must discover what is really going on and turn the tables on the scheming Su Lin.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 45,
        "episodeTitle": "Double 'O Chipmunk",
        "year": 1989,
        "air date": "December 20",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Dale and Zipper decide to emulate their heroes, Dirk Suave (Double 'O Super-Spy) and Odd Shoe, and soon become involved in a real spy caper.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 46,
        "episodeTitle": "Gadget Goes Hawaiian",
        "year": 1989,
        "air date": "December 21",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Gadget is tricked by her Hawaiian double, Lahwhinie into trading places with her right before the Hawaiian mouse is to be tested for her worthiness to become queen of the mice.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 47,
        "episodeTitle": "It's a Bird, It's Insane, It's Dale!",
        "year": 1989,
        "air date": "December 22",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Two parts of a meteor crashing into Earth give Dale and a crooked travel agent super stretching powers. Dale becomes the Rubber Bando and leaves the Rangers, while Seymour uses his powers to steal national monuments for ransom. Soon the Rubber Bando is blamed for the thefts, and must turn to the Rangers for help.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 48,
        "episodeTitle": "Short Order Crooks",
        "year": 1990,
        "air date": "February 5",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Monterey Jack and Zipper go to an abandoned diner to prepare Monty's famous cheese chowder (after it explodes in their kitchen), only to discover that a pair of crooks are using the diner to dig their way into a neighboring bank. Things get complicated when the police mistake the crooks for the chefs behind the cheese chowder and the police come over to try it.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 49,
        "episodeTitle": "Mind Your Cheese and Q's",
        "year": 1990,
        "air date": "February 6",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "After botching a rescue due to a cheese attack, Monterey Jack decides to give up cheese, which is easier said than done, especially when there's a cheese shortage in town courtesy of Rat Capone.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 50,
        "episodeTitle": "Out of Scale",
        "year": 1990,
        "air date": "February 8",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A gangster has kidnapped Professor Nimnul, and is using his Gigantico Gun (in reverse) to steal museums and statues, both for the valuables inside, and to provide doll houses for his spoiled daughter Buffy. The Rangers are on the case, until Chip and Dale are captured and forced to be Buffy's pets.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 51,
        "episodeTitle": "Dirty Rotten Diapers",
        "year": 1990,
        "air date": "February 19",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Gadget decides to adopt a policy of non-violence for the team, which is immediately put to the test as the Rangers investigate a dwarf posing as a baby to rob the homes of rich childless couples.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 52,
        "episodeTitle": "Good Times, Bat Times",
        "year": 1990,
        "air date": "February 21",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A washerwoman named Winifred is seeking to become a witch by means of a spell she found in the library. Compiling the ingredients are her familiars: Bud the snake, Lou the spider, and Foxglove the bat. During her mission, Foxglove falls in love with Dale, and has second thoughts about being a villain.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 53,
        "episodeTitle": "Pie in the Sky",
        "year": 1990,
        "air date": "February 22",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers help a lost sparrow return to Capistrano and discover a bad 'chicken' pie outfit using an electromagnet to catch the migrating birds. This episode also has references to the Stage Musical, Sweeney Todd: The Demon Barber of Fleet Street.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 54,
        "episodeTitle": "Le Purrfect Crime",
        "year": 1990,
        "air date": "March 19",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "When the Rangers learn that dogs are fleeing from Paris, they travel there and learn about the latest plot of Maltese de Sade, Fat Cat's cousin. Meanwhile, Dale realizes he's a distraction to the rest of the Rescue Rangers and wanders aimlessly through Paris, where he suffers amnesia and is brainwashed by Maltese de Sade into fighting against his friends.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 55,
        "episodeTitle": "When You Fish Upon a Star",
        "year": 1990,
        "air date": "March 21",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "When the Rangers go to investigate a sunken ship, they learn that Fat Cat is responsible, as he hired fireflies to confuse the captain.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 56,
        "episodeTitle": "Rest Home Rangers",
        "year": 1990,
        "air date": "March 22",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "When Professor Nimnul invents an aging ray and turns Monty (who is already insecure about getting old) into an old man, the rangers attempt to stop the mad Professor and reverse the effects of his ray on Monty.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 57,
        "episodeTitle": "A Lean on the Property",
        "year": 1990,
        "air date": "April 16",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Monty's mother Camembert Kate (last seen at the end of 'Parental Discretion Retired') comes to visit, but Monty can't stand her smothering and does what he can to prove that he's a grown mouse. In his latest dog-ridding scheme, Fat Cat recruits a team of moles to dig underneath the foundations of the city's buildings, causing them to lean over, and driving everyone (and their dogs) out of town.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 58,
        "episodeTitle": "The Pied Piper Power Play",
        "year": 1990,
        "air date": "April 23",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Nimnul hypnotizes all the mice in town (including Monty and Gadget) into running on hamster wheels, so that they can charge a powerful generator for him. Dale's own hypnotic skills are the only thing that can help deal with this crisis.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 59,
        "episodeTitle": "Gorilla My Dreams",
        "year": 1990,
        "air date": "May 1",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rangers agree to rescue Ku-Ku the gorilla's pet kitten Boots who was catnapped by Fat Cat. Fat Cat is holding Boots hostage, so that Ku-Ku will commit crimes for him.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 60,
        "episodeTitle": "The S.S. Drainpipe",
        "year": 1990,
        "air date": "May 2",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Rat Capone's use of slave labour to build himself a castle draws the attention of the Rangers  unfortunately, Dale's attempts to emulate his TV hero, the Red Badger of Courage, lead to the other four rangers becoming the slave labour.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 61,
        "episodeTitle": "Zipper Come Home",
        "year": 1990,
        "air date": "September 10",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Zipper leaves the Rescue Rangers after Monty blames him for ruining his cheese souffle and becomes the king of a tribe of water beetles. Little does he know that the tribe has a bad habit of sacrificing their kings to a giant frog.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 62,
        "episodeTitle": "Puffed Rangers",
        "year": 1990,
        "air date": "September 18",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The Rescue Rangers go to Hong Kong, where a cereal manufacturer is smuggling cars into the US without import fees by shrinking them into cereal toys.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 63,
        "episodeTitle": "A Fly in the Ointment",
        "year": 1990,
        "air date": "September 26",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Professor Nimnul has invented a device to transmit himself across telephone wires, and uses it to steal scientific devices from guarded laboratories. A neglected Zipper discovers Nimnul in the act and is caught in the Modemizer with him, leading to two creatures out of The Fly.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 64,
        "episodeTitle": "A Chorus Crime",
        "year": 1990,
        "air date": "November 5",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The rangers break up when Monty and Zipper refuse to help the others locate the missing tap shoes of a female dog named Canina La Fur and instead are trying to locate the cause of what has been sinking cargo ships in the Arctic Circle. Both groups soon find that both these random events are connected, as Nimnul had stolen all of the dance shoes so that he can get a group of penguins to create icebergs through excessive tap dancing to sink the ships with and steal their cargo.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      },
      {
        "episode": 65,
        "episodeTitle": "They Shoot Dogs, Don't They",
        "year": 1990,
        "air date": "November 19",
        "network": "The Disney Channel, Syndication",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "In the final episode of the series, Zsa Zsa Labador, Canina La Fur's stand-in, strands her in Taxedermia, where all animals are fair game for hunting. Worse the rangers are separated, with Monty being stuck with Canina, and despite not being one of her fans, he must help get Canina out of the country.",
        "director": "John Kimball & Bob Zamboni",
        "genre": ["Adventure", "Comedy", "Mystery"]
      }
    ]
  },
  {
    "label": "Teenage Mutant Ninja Turtles",
    "id": 7,
    "generalThumbnail": "https://wallpapers.com/images/high/tmnt-1071-x-999-wallpaper-i28gha3x8xetcuad.webp",
    "episodes": [
      {
        "episode": 1,
        "episodeTitle": "",
        "year": 12,
        "network": "",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "",
        "director": ""
      }
    ]
  },
  {
    "label": "Mighty Max",
    "id": 8,
    "generalThumbnail": "https://upload.wikimedia.org/wikipedia/en/0/00/Mighty_Max_title_card.png?20240714195121",
    "episodes": [
      {
        "episode": 1,
        "episodeTitle": "A Bellwether in One's Cap",
        "year": 1993,
        "air date": "September 1",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "//watchadsontape.com/get_video?id=JKBbYwXWRKFjY8q&expires=1742848925&ip=F0qWKRWNFI9XKxR&token=Iumuk1U2DQd2&stream=1",
        "thumbnail": "https://thumb.tapecontent.net/thumb/JKBbYwXWRKFjY8q/d7VY3XG2aRikxzj.jpg",
        "description": "Max receives a package in the mail containing a small statue inscribed with Egyptian hieroglyphs that read: 'You have been chosen to be the cap-bearer. Go to the mini-mart and wait for a sign, Mighty Max'. Shocked by the message, Max drops the statue, shattering it and revealing a red baseball cap emblazoned with a yellow 'M'.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 2,
        "episodeTitle": "The Brain Suckers Cometh!",
        "year": 1993,
        "air date": "September 8",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "//watchadsontape.com/get_video?id=mw974wRZ9jhbrWB&expires=1742848981&ip=F0qWKRWNFI9XKxR&token=rs6e402LmWZC&stream=1",
        "thumbnail": "https://thumb.tapecontent.net/thumb/mw974wRZ9jhbrWB/ew6P2ewpgAcY6BQ.jpg",
        "description": "Max's afternoon plans are interrupted when Virgil explains that he must again save the world. This time he is whisked away to protect the Earth from an invasion of brain-devouring aliens. Neither Max nor Virgil's skills include complex computer codes. A very reluctant Max must turn to the school's most annoying computer nerd, Ernie, in order to break the alien codes and save the planet.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 3,
        "episodeTitle": "Snakes & Laddies",
        "year": 1993,
        "air date": "September 15",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "//watchadsontape.com/get_video?id=Mj840R1997ImbmX&expires=1742849665&ip=F0qWKRWNFI9XKxR&token=BBZaCGYJtKez&stream=1",
        "thumbnail": "https://thumb.tapecontent.net/thumb/Mj840R1997ImbmX/GbzrV0JeaYC16pz.jpg",
        "description": "Max's attempts to attract the attention of Jiffie, a girl in his class, are interrupted by a short stint in Egypt with Bea. There Max finds and snatches an amulet, presenting it to Jiffie and winning her affection. The amulet however belongs to a cult of snake-creatures and they arrive to reclaim it. They then kidnap Jiffie, planning to sacrifice the new bearer of the amulet so that their leader can continue his immortal existence. Max and Bea must then rescue the clueless Jiffie while avoiding the clutches of the snake cult. Note: Despite being mentioned in the episode, this is the only episode that Virgil and Norman did not appear.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 4,
        "episodeTitle": "Day of the Cyclops",
        "year": 1993,
        "air date": "September 22",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "//watchadsontape.com/get_video?id=la6k9MDGpOf7x9r&expires=1742849837&ip=F0qWKRWNFI9XKxR&token=SO-qbapp7mkh&stream=1",
        "thumbnail": "https://thumb.tapecontent.net/thumb/la6k9MDGpOf7x9r/06lMMJqapRibJKX.jpg",
        "description": "Max and his mom travel to Turkey, where they are met by Virgil and Norman. Max's mom does not seem very surprised to see a walking, talking bird creature but refuses to believe that her son is some sort of super hero (she recognizes Virgil by name, so it is conceivable that Max has introduced his new friends to his mother between episodes and she has had some time to adjust). Max and Norman are arrested when Max is accused of stealing his cap from a vendor's stand. The seller has them both thrown into the local prison at gunpoint at which Max finally convinces Norman to stop beating up the police. Meanwhile Virgil and Max's mom must work together to recover the cap after the vendor sold it. In the prison, Max and Norman are accosted by a large hulking creature named Torlak who apparently wants to feed them to the Eye of Cyclops living in the caverns beneath the prison. As usual, adventures ensue and the day is saved.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 5,
        "episodeTitle": "Let Sleeping Dragons Lie!",
        "year": 1993,
        "air date": "October 6",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "//watchadsontape.com/get_video?id=KA7PYW46WJT01WK&expires=1742849861&ip=F0qWKRWNFI9XKxR&token=aMLVaH50lrb1&stream=1",
        "thumbnail": "https://thumb.tapecontent.net/thumb/KA7PYW46WJT01WK/0BwQqV8pMKCbrxO.jpg",
        "description": "Posing as the god Loki, Skullmaster convinces a Nordic sorcerer called Ravendark to awaken sleeping the Doom Dragon from its enchanted sleep. Virgil Max and company do battle with the Dragon, during which Norman reveals that he was recognized as Thor in ancient times.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 6,
        "episodeTitle": "Rumble in the Jungle",
        "year": 1993,
        "air date": "October 13",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "//watchadsontape.com/get_video?id=34lWWQ0lMGfdZA1&expires=1742849907&ip=F0qWKRWNFI9XKxR&token=zfWoBbvorMZN&stream=1",
        "thumbnail": "https://thumb.tapecontent.net/thumb/34lWWQ0lMGfdZA1/pLM1AZeAK9fG9l.jpg",
        "description": "While on an expedition in the Congo, Max's mom uncovers and is captured by a lost civilization of talking gorillas who enslave primitive human beings. Max, Virgil, and Norman arrive and find the civilization. When they locate Max's mom, they are taken captive by the gorilla general and taken before the Ape King.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 7,
        "episodeTitle": "The Mother of All Adventures",
        "year": 1993,
        "air date": "October 20",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "//watchadsontape.com/get_video?id=yPkZO3WWZBh14Mg&expires=1742849933&ip=F0qWKRWNFI9XKxR&token=YeyffSPI3KIl&stream=1",
        "thumbnail": "https://thumb.tapecontent.net/thumb/yPkZO3WWZBh14Mg/vrdgpo9GkRTLY2.jpg",
        "description": "Max's mom brings a figurine back from Haiti that turns out to be filled with zombie parasites.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 8,
        "episodeTitle": "Norman's Conquest",
        "year": 1993,
        "air date": "October 27",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Norman struggles with his fear of facing Spike, an old adversary of his family who murdered his father. Spike vowed ten thousand years ago to finish off Norman as well, and he intends to keep that promise. Guest starring Brad Garrett as the voice of Spike.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 9,
        "episodeTitle": "Less Than 20,000 Squid Heads Under the Sea",
        "year": 1993,
        "air date": "November 3",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max, Virgil, Norman, and a rich Texan travel underwater in a submarine to battle a giant octopus that is responsible for capturing and destroying ships. While underwater, the group encounters a squid civilisation.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 10,
        "episodeTitle": "Bring Me the Head of Mighty Max",
        "year": 1993,
        "air date": "November 10",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Skullmaster uses the crystal of souls to awaken the former inhabitants of an ancient city to retrieve the cosmic cap from Max along with his head. When the zombies arrive Norman and Max decide to stand their ground, but Virgil urges that fighting is pointless and dangerous because the zombies are soulless and cannot be killed. His warnings are ignored, so Virgil escapes with the cap intending to destroy it to save both Max and Norman. Max and Norman remember that the cap is indestructible, but Virgil is willing to go so far as sacrificing himself for his friends.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 11,
        "episodeTitle": "Werewolves of Dunneglen",
        "year": 1993,
        "air date": "November 17",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max, Virgil, and Norman travel to Scotland where there are reported sightings of werewolves. While there, Norman and Virgil are imprisoned as suspects and Max meets a man named Cameron who turns out to be a werewolf. Max and Cameron investigate and learn that a scientist named Professor MacDougal is stealing the blood of natural werewolves in an effort to turn herself into an even more powerful werewolf and steal their immortality in the process. Max and Cameron defeat MacDougal with the help of the other werewolves and Cameron takes his pack into the forest to live in peace.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 12,
        "episodeTitle": "Out in the Cold",
        "year": 1993,
        "air date": "December 1",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Space aliens take over a science station in the Arctic and assume the identities of its researchers. The aliens can only survive in freezing cold temperatures and plan to make the earth their new home by altering the entire planet's climate by creating a new ice age. It is up to Max, Norman, and Virgil to stop them, but matters are complicated when they learn that the aliens can disguise themselves as ordinary humans.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 13,
        "episodeTitle": "The Maxnificent Seven",
        "year": 1993,
        "air date": "December 8",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max has been having nightmares about Skullmaster's zombie legions tracking him down, so Virgil suggests that they gather a band of heroes and enter Skull Mountain to destroy the Crystal of Souls. Max then travels to the four corners of the Earth gathering heroes (Hanuman, the monkey King, Beowulf, who slew the monstrous Grendel with his bare hands, Jonayaiyin, a Native American shaman, and Modjadji, an African warrior queen). This 'maxnificent seven' enters Skull Mountain and battles an army of Skullmaster's monsters. From each of the heroes Max learns a lesson in bravery, then enters Skullmaster's inner sanctum alone and finds the courage to destroy the Crystal of Souls. The heroes make a last stand to enable Max, Norman and Virgil to escape. At the very end, Max is shown placing flowers near a cross with mementos from each hero on it, as a memorial.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 14,
        "episodeTitle": "Pandora's Box, part 1",
        "year": 1994,
        "air date": "September 22",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "With Skullmaster's Crystal of Souls broken, the former ruler of the Earth's core Lava Lord is released from his prison. He plans to retake his kingdom from Skullmaster with a giant robot called Magus. Meanwhile, Max is getting tired of never being able to have fun because of his duties as the Mighty One. Virgil agrees that he can give up saving the world if he goes on one last quest to strike at Skullmaster while he is weakened. Once in the underworld, Virgil is captured by Skullmaster's minions. Because of a prophecy that they are destined to die together, he attempts to forge an alliance with the fowl.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 15,
        "episodeTitle": "Pandora's Box, part 2",
        "year": 1994,
        "air date": "September 23",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Lava Lord meets Skullmaster's forces with Magus, but thanks to Virgil's tactical advice Lava Lord is knocked out of his robot, which allows Max and Norman to hijack it. They head to Skull Mountain to get to the bottom of Virgil's betrayal. Although suspicious of Virgil at first, Max realizes that his partnership with Skullmaster was a complex ploy to let Max get his hands on Magus. However, Skullmaster uses Virgil as a shield, and Max refuses to kill Skullmaster at the cost of Virgil's life. Instead, he allows Skullmaster and Warmonger to escape to the Earth's surface with them.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 16,
        "episodeTitle": "Blood of the Dragon",
        "year": 1994,
        "air date": "September 26",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "After being released from his inner earth prison, Skullmaster travels to Malananuka the Dragon Isle where he preys on and deceives some of the native inhabitants into drinking dragon's blood. This transforms them into reptilian humanoid Zilards that become mindless slaves obedient to his commands. Max, Virgil, and Norman head to the island to stop him and encounter a young native who is stuck in mid transformation because he did not fully drink the dragon's blood and was previously found by a circus. Together they attempt to rescue the rest of the natives who have not drank the blood of the dragon while contending with Skullmaster, Warmonger, the Zilards, and a giant dragon whose wingbeats move Malananuka.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 17,
        "episodeTitle": "The Missing Linked",
        "year": 1994,
        "air date": "September 27",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The citizens of the town of Schlepak are disappearing. Max, Virgil, and Norman investigate when a young girl informs them that a monstrous creature has captured her brother. They discover that a mad scientist who, having been ignored by the townspeople for his entire life, has created a slime creature called Corpus which devour metal and human beings. After Norman is consumed, Max and Virgil set out to defeat the scientist and rescue the townspeople. As a running joke through the episode, the name of the scientist is never revealed. Every time he attempts to disclose it, something interrupts him.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 18,
        "episodeTitle": "Year of the Rat",
        "year": 1994,
        "air date": "September 28",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "The ancient Emperor of Rats, Lao Chu, has been freed from his spiritual prison, possessing the body of Ki Wan, the historian who freed him. Max must now find a way to stop the evil creature's plan of a rat-dominated world. The complex puzzles of Lao Chu's temple may present a challenge to even the mathematically precise Virgil.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 19,
        "episodeTitle": "The Cyberskull Virus",
        "year": 1994,
        "air date": "September 29",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max plays a videogame called 'Dementoids', and is called to investigate a sighting of a giant digital monster like one from the game. They find that a villain called Cyberskull is responsible, and he has created a virus that can turn the real world into a digital horror zone. Max pits his skill at the 'Dementoids' game to use against Cyberskull, and ultimately manages to destroy the virus, returning the world to normal and trapping the Cyberskull in cyberspace.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 20,
        "episodeTitle": "Zygote's Rhythm",
        "year": 1994,
        "air date": "September 30",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max and his iguana Thor join Virgil and Norman to investigate an island full of 'dinosaurs'. Instead they find that an evil scientist on the island, Dr. Zygote, has invented a way to 'de-evolve' modern animals. After Zygote turns Thor into an enormous prehistoric lizard, Max confronts the twisted genius and turns his own evolution ray on him. Set to evolve instead of de-evolve, the ray turns Zygote into a hideous floating creature with an enormous brain. Out of control, the scientist crashes through his observation dome and dives into the sea below. A satisfied Max then uses the ray to revert the animals back to normal, including his beloved Thor.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 21,
        "episodeTitle": "Along Came Arachnoid",
        "year": 1994,
        "air date": "October 3",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Norman must face one of his few fears - spiders - when Max and company find themselves confronting a mutated scientist obsessed with spiders. Determined to stop Max and crew, the scientist (calling himself 'Doctor Arachnoid') releases a two-story tall spider on them. Max figures that the only way he can make Norman face the spider is to place himself in the creature's path, forcing the Guardian to defend him.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 22,
        "episodeTitle": "The Axeman Cometh",
        "year": 1994,
        "air date": "October 4",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "As Canadian lumberjacks cut down a redwood in the forest, they unwittingly free Lokjar, the ancient demon of violence. Lokjar cuts a bloody path of destruction to find his magic axe and key to his indestructible face mask that binds his terrible powers. Mighty Max and friends races to find the items first but Norman who faced the immortal demon in the past is determined to destroy him instead. Max must talk some sense to Norman before Lokjar is freed from his bonds.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 23,
        "episodeTitle": "Beetlemania",
        "year": 1994,
        "air date": "October 5",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max, Bea, Virgil and Norman discover that what appears to be an invasion of beetles, accompanied by a giant beetle-like monster, are actually space aliens.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 24,
        "episodeTitle": "Souls of Talon",
        "year": 1994,
        "air date": "October 6",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Talon, a sentient skull carried about by an enormous bird, attempts to escape the astral plane but the guardian of the only portal out refuses to admit anyone but the cap-bearer. Talon's bird claws at the gate, causing natural disasters in the real world. When Max and the others investigate Max disregards warnings from Virgil not to enter a portal to the astral plane and finds himself pursued by Talon. Talon steals his cap, allowing him to escape and begin stealing souls from Manhattan, but Max manages to return by convincing the gatekeeper that even without the cap, he is still the cap-bearer. Talon seems unstoppable, but while on the astral plane Max found the disc that is the source of Talon's immortality, and traps him on the astral plane again by tossing the disc through the portal.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 25,
        "episodeTitle": "Tar wars",
        "year": 1994,
        "air date": "October 7",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max and his mom visit the La Brea Tar Pits where they encounter a caveman named Gor and a sabertooth tiger who are destined to fight for eternity ever since both of them were exposed to a radioactive meteorite.Guest starring Ron Perlman as the voice of Gor.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 26,
        "episodeTitle": "Clown Without Pity",
        "year": 1994,
        "air date": "November 14",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max, Norman and Virgil find themselves in a circus inhabited by a clown, Freako. They learn that Freako, who was born with a permanent clown's face, is now out for revenge by capturing kids and turning them into sideshow-like mutants.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 27,
        "episodeTitle": "Max vs. Max",
        "year": 1994,
        "air date": "November 15",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Another boy by the name of Maximillion is discovered by Virgil as a potential chosen one. With the prophecy being unclear as to which one is the true cap bearer, the two compete in a competition of heroic deeds in order to prove their value. Meanwhile Skullmaster works on infiltrating an ancient city in order to get a hold of the Lemurian Arcana, the most powerful book of spells in the world. Maximillion is revealed to be a spy of Skullmaster designed to get a hold of the cosmic cap in order to activate the portal into the city. Virgil eventually reveals that he moved the book 5,000 years ago at the time of Skullmaster's imprisonment, and is coerced into revealing its location in exchanges for Max's life. Skullmaster, now with the book, leaves through a portal provided by Maximillion. Before Maximillion can go through, he is tackled by Max who manages to steal away the necklace that was controlling him. With Virgil now furious at Max for allowing Skullmaster to have everything he needs to conquer the world, Max reveals that he ripped out several pages from the Arcana while Skullmaster had a hold of him. Skullmaster is furious that his victory is only bittersweet as he only has half of the book and no cosmic cap in his possession.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 28,
        "episodeTitle": "Cyberskull II: The Next Level",
        "year": 1994,
        "air date": "November 16",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Cyberskull is back and this time, he seeks to create a physical body for himself.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 29,
        "episodeTitle": "Fuath and Beggora",
        "year": 1994,
        "air date": "November 17",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Mighty Max is summoned to Ireland to stop an evil beyond imagination from being unleashed. Max, Norman, Virgil meet a young villager named Katlin and discover that Katlin's father leads a secret sect of Druids who plan to awaken Fuath, a clockwork stone giant to conquer the world as revenge for humanity rejecting their dominion. When Fuath proves to be uncontrollable and goes on an rampage, Max must uncover the secret of what powers Fuath and put a stop to it once and for all.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 30,
        "episodeTitle": "Dawn of the Conqueror",
        "year": 1994,
        "air date": "November 18",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Norman must do battle with a lion-headed warrior known as 'The Conqueror' from dawn till dusk in order to extend his life for another 10,000 years. In preparation for the lethal contest, Norman bids Max and Virgil farewell as he feels he must do this task alone. Max determines not to let Norman take on this fight alone, and must retrace his steps from memory through various portals in order to reunite with his companions in Greece.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 31,
        "episodeTitle": "Scorpio Rising",
        "year": 1994,
        "air date": "November 21",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Strange radiation readings in the desert outside of Las Vegas, Nevada bring Max and company to the area. In caverns nearby, they find a crazed nuclear scientist who plans to use giant mutated scorpions and his own natural immunity to radiation as a means to take revenge on those who caused his condition. He believes that the world itself needs to be cleansed by 'pure, beautiful' radiation.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 32,
        "episodeTitle": "Zygote Music",
        "year": 1994,
        "air date": "November 22",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Dr. Zygote returns in his evolved form, but over the past time since their last encounter, has learned to use many of his psychic powers. In his continuing quest for evolution, he abducts a young boy who has the ability of telekinesis, and attempts to use his genetic material to further advance his own evolutionary state. The abduction of the young boy alerts Virgil and Norman who then meet up with Max in order to track down the missing boy.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 33,
        "episodeTitle": "Good Golly Ms. Kali",
        "year": 1994,
        "air date": "November 23",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "A man revives the serpent demon Naja, who begins gathering the pieces of an idol of Kali, the Hindu goddess of death and destruction, to revive her as well. Max and the gang try to stop him, along the way picking up pieces of an idol of the god Shiva. Naja manages to summon and enslave Kali, but Max is able to assume Shiva's powers and release Kali, who kills Naja before returning with Shiva's spirit to their home.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 34,
        "episodeTitle": "Around the World in Eighty Arms",
        "year": 1994,
        "air date": "November 24",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max finds himself working with Jules Verne after the legendary author and scientist's multi-tentacled submarine - the Nautilus - is stolen by a band of pirates led by none other than Nemo himself. Verne, having slept in a cryogenic chamber for years, found himself facing the grandson of the pirate captain made infamous in his book Twenty Thousand Leagues Under the Seas. The younger Nemo claimed the Nautilus as his family's own, and planned to use it to dominate the shipping lanes and recapture the former glory of his family's name.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 35,
        "episodeTitle": "Fly by Night",
        "year": 1994,
        "air date": "November 25",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max, Norman, and Virgil head to London to investigate a sudden string of attacks where victims are being drained of blood. Virgil insists that a vampire is on the prowl and that the only way to stop it is the use of traditional folklore and tools to slay it. When they encounter Countess Moska, a vampire that displays fly-like qualities unheard of the bloodsuckers of legend, Max must discover a new way to stop Moska's reign of terror before she unleashes a new generation of vampires.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 36,
        "episodeTitle": "The Mommy's Hand",
        "year": 1994,
        "air date": "November 28",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max's mom again finds herself in danger when a ring placed on her hand compels her to go to Egypt. Following out of concern, Max and company find that the ring belongs to Isis, an ancient Egyptian goddess who has been living among humans for a few thousand years. Now a little unhinged, she is attempting to awaken her husband Osiris hoping that he will destroy the human race for its many faults and injustices. However, Osiris spares humanity after learning Max is the 'Chosen One' and departs along with his wife.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 37,
        "episodeTitle": "I, Warmonger",
        "year": 1994,
        "air date": "November 29",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Skullmaster and Warmonger travel to 'Zero Island' off the western coast of Africa in order to offset the balance of nature by disturbing the ancient Hydra, a monster with two heads: one representing light and the other dark who keeps in balance the good and evil power of nature. Using some of the magic of the Lemurian Arcana, Skullmaster causes the balance in Hydra to tip in favor of darkness. However, Warmonger takes this chance to betray Skullmaster by keeping the page of control from the book for himself and orders Hydra to destroy Skullmaster. Max, Virgil, and Norman show up in time to realize what is happening and attempt to protect Skullmaster out of fear that it will disrupt the prophecy since Max is destined to defeat Skullmaster. They fail to protect Skullmaster who is seemingly killed and Max is forced to use the most powerful page that they had obtained from the Arcana in order to put the light energy of Hydra back in balance. The island sinks as a result and Warmonger escapes only to find out that Skullmaster had arranged all this to force Max to use his page of the Arcana, the one thing he feared most. Skullmaster promises that Warmonger will be rewarded for his loyalty later on.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 38,
        "episodeTitle": "Sirius Trouble",
        "year": 1994,
        "air date": "November 30",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Aliens from a planet orbiting Sirius come to Earth, and while trying to stop them Max unwittingly starts a heated argument between Norman and Virgil that keeps them from working together through the entire episode. Max finally gets them to settle the dispute and work together. Aboard the aliens' ship, Max finds out that they have been stealing toxic waste, a source of fuel for them, and happily let the aliens go on their way with it.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 39,
        "episodeTitle": "Armageddon Closer",
        "year": 1994,
        "air date": "December 1",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "Max's birthday falls on the winter solstice, the day that is filled with the most darkness. Having now reforged his Crystal of Souls and filled it with the souls of the Zilards of Malananuka the Dragon Isle, Skullmaster now puts in to play his final plan for victory he has been working towards ever since his escape from Skull Mountain. Virgil and Norman show up at Max's birthday party to show him the prophecy in their home in the Himalayas Mountains. There, they reveal to him that the Prophecy is a set of murals that have been predicting the future based on current events and it now shows that Skullmaster is ready to begin his conquest of the world. Skullmaster and Warmonger launch a surprise attack on the three in their home leaving them with no choice but to run. As they are running, Virgil informs Max that they must evade Skullmaster until after the Winter Solstice or else Skullmaster will win. As they flee from portal to portal, they encounter previously defeated monsters Eye of Cyclops controlling the Cyclops skeleton and Cyberskull who were revived by and under Skullmaster's control. Eventually, they encounter Arachnoid's giant mutated spider they had previously fought and Norman had a fear against as this time Norman realizes that his destiny is about to conclude.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      },
      {
        "episode": 40,
        "episodeTitle": "Armageddon Outta Here",
        "year": 1994,
        "air date": "December 2",
        "network": "Syndication (US) & Canal+ (France)",
        "length": "",
        "videoUrl": "",
        "thumbnail": "",
        "description": "In order to buy Max and Virgil time to escape, Norman engages Arachnoid's mutated spider in battle realizing that the time of his destiny has come. Max resists leaving Norman to die, but Virgil forces him to flee explaining to him that this moment was foretold on by the prophecy; the mural in their home. After fleeing, Max is furious that Virgil let Norman die upon which Virgil explains that each person's end is foretold and that Virgil's end will be at Stonehenge, a place Max must avoid until after the solstice. Skullmaster and Warmonger show up again, and in order to save Max, Virgil sends him to the Astral Plane, the one place Skullmaster cannot follow. Skullmaster abducts Virgil and takes him to Stonehenge while relaying a message to Max through Talon (the monster in the Astral Plane) that if he fails to show up, he will kill Virgil. Desperate for help, Max heads to Skull Mountain to recruit Lava Lord's help in getting revenge on Skullmaster. Lava Lord takes his new and improved Magus to Stonehenge with Max. Skullmaster summons Fuath to battle with Lava Lord and Magus while Max attempts to save Virgil. After Fuath is defeated, Skullmaster overcomes Lava Lord and Magus with the power of the Crystal of Souls and then demands that Max hand over the cosmic cap in exchange for Virgil's life. Despite Virgil's protest, Max agrees upon which Skullmaster kills Virgil and orders Warmonger to restrain Max while he explains what is about to happen. Now with the Cosmic Cap (which changes into a cosmic crown) and Crystal of Souls, Skullmaster stands in the center of Stonehenge, where he absorbs the powers of time itself on the sunset of the winter solstice and is able to rewrite the past, present, and future. While Warmonger has been killed by Skullmaster as part of the reward that Skullmaster promised Warmonger, Max grabs a hold of the staff with the Crystal of Souls. Using his connection with the cap, Max is able to partially absorb the energy as well and uses it to reverse time back to when he first got the cap. Now back at the beginning, he realizes that he is reliving the past and decides that this time around he is going to ensure he fulfills his destiny.",
        "director": "",
        "producer": "Phil Roman & Rob Hudnut",
        "genre": ["Fantasy", "Science fiction", "Superhero"]
      }
    ]
  },
  {
    "label": "Pluto",
    "id": 9,
    "generalThumbnail": "",
    "episodes": []
  },
  {
    "label": "Strumpfovi",
    "id": 10,
    "generalThumbnail": "",
    "episodes": []
  },
  {
    "label": "Mornar Popaj",
    "id": 11,
    "generalThumbnail": "",
    "episodes": []
  },
  {
    "label": "Vitez Koja",
    "id": 12,
    "generalThumbnail": "",
    "episodes": []
  }
]
